-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- Generation Time: Jan 16, 2023 at 12:22 PM
-- Server version: 5.7.31
-- PHP Version: 7.3.21

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `shop`
--

-- --------------------------------------------------------

--
-- Table structure for table `admin`
--

DROP TABLE IF EXISTS `admin`;
CREATE TABLE IF NOT EXISTS `admin` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `email` text COLLATE utf8_persian_ci NOT NULL,
  `password` text COLLATE utf8_persian_ci NOT NULL,
  `status` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `admin`
--

INSERT INTO `admin` (`id`, `email`, `password`, `status`) VALUES
(1, 'admin@gmail.com', '21232f297a57a5a743894a0e4a801fc3', 1),
(2, 'admin1@gmail.com', '21232f297a57a5a743894a0e4a801fc3', 1);

-- --------------------------------------------------------

--
-- Table structure for table `backet`
--

DROP TABLE IF EXISTS `backet`;
CREATE TABLE IF NOT EXISTS `backet` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `pid` int(11) NOT NULL,
  `uid` int(11) NOT NULL,
  `ctime` timestamp NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=171 DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `backet`
--

INSERT INTO `backet` (`id`, `pid`, `uid`, `ctime`) VALUES
(82, 27, 15, '2019-02-22 13:45:17'),
(85, 31, 14, '2022-02-24 11:01:52'),
(93, 27, 14, '2022-05-06 16:15:22'),
(84, 31, 13, '2019-02-24 10:46:17'),
(83, 28, 15, '2019-02-22 13:45:23'),
(88, 28, 16, '2022-04-10 06:56:53'),
(89, 27, 16, '2022-04-10 06:57:06'),
(91, 30, 77, '2022-05-04 16:09:35'),
(94, 56, 78, '2022-07-23 14:15:16'),
(92, 27, 77, '2022-05-05 09:18:30'),
(95, 30, 15, '2022-09-21 11:58:53'),
(96, 30, 14, '2022-10-09 06:45:19'),
(98, 32, 15, '2022-11-07 18:00:52'),
(167, 40, 79, '2022-12-12 10:43:20'),
(168, 41, 79, '2022-12-12 10:43:27'),
(170, 41, 15, '2022-12-15 20:41:00'),
(162, 30, 78, '2022-12-10 14:46:20'),
(169, 46, 15, '2022-12-15 20:40:32');

-- --------------------------------------------------------

--
-- Table structure for table `blog`
--

DROP TABLE IF EXISTS `blog`;
CREATE TABLE IF NOT EXISTS `blog` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `image` text COLLATE utf8_persian_ci NOT NULL,
  `description` text COLLATE utf8_persian_ci NOT NULL,
  `ctime` timestamp NOT NULL,
  `status` varchar(255) COLLATE utf8_persian_ci NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=21 DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `blog`
--

INSERT INTO `blog` (`id`, `title`, `image`, `description`, `ctime`, `status`) VALUES
(15, 'Ø¨Ø±ØªØ±ÛŒÙ† Ø²Ø¨Ø§Ù† Ù‡Ø§ÛŒ Ù‡Ø§ÛŒ Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ø­Ø§Ù„ Ø­Ø§Ø¶Ø± (2019)', 'WIN_20180507_06_28_26_Pro.jpg', '<p><strong>1.Ù¾Ø§ÛŒØªÙˆÙ† (Python)</strong></p><p>Ø¨Ø± Ø§ÛŒÙ†Ú©Ù‡ Ø¯Ø± Ø­Ø§Ù„ Ø­Ø§Ø¶Ø± Ù¾Ø§ÛŒØªÙˆÙ† Ø¨Ø§Ø²Ø§Ø± Ø±Ø§ Ù…Ø¯ÛŒØ±ÛŒØª Ù…ÛŒÚ©Ù†Ø¯ Ø§Ù†Ú©Ø§Ø±ÛŒ Ù†ÛŒØ³Øª. Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ù‚Ø¯Ø±ØªÙ…Ù†Ø¯ Ø¨Ù‡ ØµÙˆØ±Øª Interpreter Ø¹Ù…Ù„ Ù…ÛŒÚ©Ù†Ø¯. Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø¨Ù‡ Ø·ÙˆØ± Ø§Ù†Ø­ØµØ§Ø±ÛŒ Ø³ÛŒÙ†ØªÚ©Ø³ Ø³Ø§Ø¯Ù‡ Ø§ÛŒ Ø¯Ø§Ø±Ø¯ ØªØ§ Ø¨Ø±Ø§ÛŒ Ø¬Ù…Ø¹ Ø¢ÙˆØ±ÛŒ Ø¨Ù„ÙˆÚ© Ù‡Ø§ Ø§Ø² Ú©Ø¯ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ø´ÙˆØ¯ Ú©Ù‡ Ø¨Ù‡ Ø±Ø§Ø­ØªÛŒ Ù‚Ø§Ø¨Ù„ Ø®ÙˆØ§Ù†Ø¯Ù† Ø§Ø³Øª.</p><p>Ø§Ø² Ø³Ø§Ù„ 1991 Ù¾Ø§ÛŒØªÙˆÙ† Ø±Ø§ Ù…ÛŒØªÙˆØ§Ù† Ø¨Ù‡ Ø¹Ù†ÙˆØ§Ù† Ø¨Ø®Ø´ÛŒ Ø§Ø² Ø­ÙˆØ²Ù‡ Ù‡Ø§ÛŒÛŒ Ù…Ø§Ù†Ù†Ø¯: ØªÙˆØ³Ø¹Ù‡ Ø¨Ø§Ø²ÛŒØŒ ØªÙˆØ³Ø¹Ù‡ ÙˆØ¨ØŒ ØªØ­Ù‚ÛŒÙ‚Ø§Øª Ø¹Ù„Ù…ÛŒØŒ Ø§Ø³Ú©Ø±ÛŒÙ¾Øª Ù†ÙˆÛŒØ³ÛŒ Ùˆ ØªÙ‚Ø±ÛŒØ¨Ø§ Ù‡Ø± Ú†ÛŒØ²ÛŒ Ú©Ù‡ Ø´Ù…Ø§ ØªØµÙˆØ± Ù…ÛŒÚ©Ù†ÛŒØ¯ØŒ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ú©Ù†ÛŒØ¯.</p><p><strong>2.Ø³ÛŒ Ù¾Ù„Ø§Ø³ Ù¾Ù„Ø§Ø³ (</strong><strong>C++)</strong></p><p>Ø¯Ø± Ø³Ø§Ù„ 1983ØŒØ³ÛŒ Ù¾Ù„Ø§Ø³ Ù¾Ù„Ø§Ø³ Ø¨Ù‡ Ø¹Ù†ÙˆØ§Ù† Ø²ÛŒØ± Ù…Ø¬Ù…ÙˆØ¹Ù‡ Ø§ÛŒ Ø§Ø² Ø²Ø¨Ø§Ù† Ø³ÛŒ Ø³Ø§Ø®ØªÙ‡ Ø´Ø¯. Ø§Ø­ØªÙ…Ø§Ù„Ø§ Ø´Ù†Ø§Ø®ØªÙ‡ Ø´Ø¯Ù‡ ØªØ±ÛŒÙ† Ù…Ø­ØµÙˆÙ„Ø§Øª Ø³ÛŒ Ù¾Ù„Ø§Ø³ Ù¾Ù„Ø§Ø³ Ù¾ÛŒØ´Ø±ÙØª MS ÙˆÛŒÙ†Ø¯ÙˆØ² Ùˆ Ú¯ÙˆÚ¯Ù„ Ú©Ø±ÙˆÙ… Ø§Ø³Øª. Ù‡Ù…Ú†Ù†ÛŒÙ† Ø³Ù‡Ù… Ø¨Ø²Ø±Ú¯ÛŒ Ø§Ø² Ø¢Ù…Ø§Ø²ÙˆÙ† Ùˆ Ø³Ø§ÛŒØª Ù‡Ø§ÛŒ Ø§Ø¯ÙˆØ¨ÛŒ Ø¨Ø§ Ø³ÛŒ Ù¾Ù„Ø§Ø³ Ù¾Ù„Ø§Ø³ Ù†ÙˆØ´ØªÙ‡ Ø´Ø¯Ù‡ Ø§Ù†Ø¯.</p><p>Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø¯Ø± Ø§ÛŒÙ† Ø³Ø§Ù„Ù‡Ø§ Ø¨Ù‡ Ø®Ø§Ø·Ø± Ú©Ø§Ø±Ø¨Ø±Ø¯ ÙØ±Ø§Ú¯ÛŒØ± Ø¢Ù† Ø¯Ø± Ø²Ù…ÛŒÙ†Ù‡ Ù‡Ø§ÛŒÛŒ Ù…Ø§Ù†Ù†Ø¯: Ù…Ø®Ø§Ø¨Ø±Ø§ØªØŒ Ø¨Ø§Ù†Ú©Ø¯Ø§Ø±ÛŒ Ø§Ù„Ú©ØªØ±ÙˆÙ†ÛŒÚ©ØŒ Ø²Ù…ÛŒÙ†Ù‡ Ù‡Ø§ÛŒ Ù…Ø§Ù„ÛŒØŒ Ø®Ø±Ø¯Ù‡ ÙØ±ÙˆØ´ÛŒ Ùˆ Ø¨Ø§Ø²ÛŒ Ù‡Ø§ Ù…Ø´Ù‡ÙˆØ±ØªØ± Ø´Ø¯Ù‡ Ø§Ø³Øª.</p><p><strong>3.Ø³ÙˆÛŒÙØª (</strong><strong>Swift)</strong></p><p>Ø³ÙˆÛŒÙØª ØªÙˆØ³Ø· Ø§Ù¾Ù„ ØªÙˆØ³Ø¹Ù‡ Ø¯Ø§Ø¯Ù‡ Ù…ÛŒØ´ÙˆØ¯. Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø¨Ø±Ø§ÛŒ ØªØ«Ø¨ÛŒØª Ùˆ Ø§ÙØ²Ø§ÛŒØ´ Ù…Ø´Ø®ØµØ§Øª Ù…ØªØ¹Ø¯Ø¯ Objective-C Ø·Ø±Ø§Ø­ÛŒ Ø´Ø¯Ù‡ Ø§Ø³Øª Ú©Ù‡ Ø´Ø¨ÛŒÙ‡ Ø¨Ù‡ Ø³Ø±Ø¹Øª Ø¢Ù† Ø§Ø³Øª.</p><p>Ø¹Ù„Ø§ÙˆÙ‡ Ø¨Ø± Ø§ÛŒÙ† Ø³ÙˆÛŒÙØª Ø±Ø§ Ø¨Ù‡ Ø¹Ù†ÙˆØ§Ù† Objective-C Ø¯Ø± Ù†ÙˆØ¹ Ø§Ù…Ù†ÛŒØªÛŒØŒ Ø§ÛŒÙ…Ù†ÛŒ Ùˆ Ø§Ø¬Ø±Ø§ÛŒ Ø¨Ù‡ØªØ± Ø³Ø®Øª Ø§ÙØ²Ø§Ø± Ù…ÛŒØ´Ù†Ø§Ø³Ù†Ø¯. Ù‡Ù…Ú†Ù†ÛŒÙ† Ø´Ø§Ù…Ù„ ÙˆÛŒÚ˜Ú¯ÛŒ Ù‡Ø§ÛŒ Ø¯ÛŒÚ¯Ø± Ø²Ø¨Ø§Ù† Ù‡Ø§ÛŒ Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ù…ÛŒ Ø¨Ø§Ø´Ø¯ Ú©Ù‡ Ø§ÛŒÙ† Ø¨Ø±Ø§ÛŒ Ø³ÙˆÛŒÙØª ÛŒÚ© ÙˆÛŒÚ˜Ú¯ÛŒ Ø¹Ø§Ù„ÛŒ Ø§Ø³Øª.</p><p>Ø§ÛŒÙ† Ù‡Ø§ Ù‡Ù…Ù‡ Ø®ÙˆØ¨ÛŒ Ù‡Ø§ÛŒ Ø³ÙˆÛŒÙØª Ù†Ø¨ÙˆØ¯Ù†Ø¯ Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø¯Ø§Ø±Ø§ÛŒ Ù‡ÙˆØ´ Ù…ØµÙ†ÙˆØ¹ÛŒ Ùˆ Ø§Ù…Ù†ÛŒØª Ø¨Ø§Ù„Ø§ÛŒÛŒ Ø§Ø³Øª. Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø²ÛŒØ¨Ø§ØŒ Ù¾ÛŒØ´Ø±ÙØªÙ‡ Ùˆ Ø§Ø¨Ø²Ø§Ø±ÛŒ Ø³Ø§Ø¯Ù‡ Ø¨Ø±Ø§ÛŒ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ø§Ø³Øª.</p><p><strong>4.Ø¬Ø§ÙˆØ§&nbsp;</strong><strong>(Java)</strong></p><p>Ø¬Ø§ÙˆØ§ Ø§Ø¨Ø²Ø§Ø±ÛŒ Ù‚Ø¯Ø±ØªÙ…Ù†Ø¯ØŒÙ‚Ø§Ø¨Ù„ Ø§Ø¹ØªÙ…Ø§Ø¯ Ùˆ Ù†Ø´Ø§Ù†Ú¯Ø± Ø¬Ø²ÛŒÛŒØ§Øª Ø§Ø³Øª Ùˆ Ø¨Ù‡ Ù†Ø¸Ø± Ù†Ù…ÛŒØ±Ø³Ø¯ Ú©Ù‡ Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø¯Ø± Ø¢ÛŒÙ†Ø¯Ù‡ Ù†Ø²Ø¯ÛŒÚ© Ù‚ØµØ¯ Ú©Ù†Ø§Ø±Ù‡ Ú¯ÛŒØ±ÛŒ Ø±Ø§ Ø¯Ø§Ø´ØªÙ‡ Ø¨Ø§Ø´Ø¯.</p><p>Ø¬Ø§ÙˆØ§ ØªÙˆØ³Ø· Ø¨ÛŒØ´ Ø§Ø² 10 Ù…ÛŒÙ„ÛŒÙˆÙ† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ Ùˆ 15 Ù…ÛŒÙ„ÛŒØ§Ø±Ø¯ Ø¯Ø³ØªÚ¯Ø§Ù‡ Ø¬Ø§ÙˆØ§ Ø¯Ø± Ø³Ø±Ø§Ø³Ø± Ø¬Ù‡Ø§Ù† Ø§Ø¬Ø±Ø§ Ù…ÛŒØ´ÙˆØ¯! (Ø¯ÙˆØ¨Ø§Ø±Ù‡ Ø¨Ù‡ Ù…ØªÙ† Ù†Ú¯Ø§Ù‡ Ù†Ú©Ù†ÛŒØ¯ Ø´Ù…Ø§ Ú©Ø§Ù…Ù„Ø§ Ø¯Ø±Ø³Øª Ø´Ù†ÛŒØ¯ÛŒØ¯!)</p><p>Ø§Ø² Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø¨Ø±Ø§ÛŒ Ø³Ø§Ø®Øª Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù‡Ø§ÛŒ Ø§Ù†Ø¯Ø±ÙˆÛŒØ¯ØŒ Ø¨Ø§Ø²ÛŒ Ù‡Ø§ØŒ Ù†Ø±Ù… Ø§ÙØ²Ø§Ø± Ùˆ Ù…Ø­ØªÙˆØ§ÛŒ Ø³Ø§ÛŒØª Ù…ÙˆØ±Ø¯ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ù‚Ø±Ø§Ø± Ù…ÛŒÚ¯ÛŒØ±Ø¯. (Ø¨Ø±Ø§ÛŒ Ù…Ø«Ø§Ù„ Ø³Ø§ÛŒØª LinkedInØŒ Ø¢Ù…Ø§Ø²ÙˆÙ† Ùˆ eBay Ø§Ø² Ø¬Ø§ÙˆØ§ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ù…ÛŒÚ©Ù†Ù†Ø¯.)</p><p><strong>5.Ø¢Ø±&nbsp;</strong><strong>(R)</strong></p><p>ÛŒÚ© Ø²Ø¨Ø§Ù† Ø¨ÛŒ Ù†Ø¸ÛŒØ± Ø¯ÛŒÚ¯Ø± Ú©Ù‡ Ø¨Ù‡ Ø·ÙˆØ± Ú¯Ø³ØªØ±Ø¯Ù‡ Ø§ÛŒ Ø¨Ø±Ø§ÛŒ ÛŒØ§Ø¯Ú¯ÛŒØ±ÛŒ Ù…Ø§Ø´ÛŒÙ† Ø§Ø³ØªÙØ§Ø¯Ù‡ Ù…ÛŒØ´ÙˆØ¯. R Ø¯Ø± Ù†Ø¸Ø± Ú¯Ø±ÙØªÙ‡ Ø´Ø¯Ù‡ Ø§Ø³Øª Ú©Ù‡ Ø±Ù‚ÛŒØ¨ Ù¾Ø§ÛŒØªÙˆÙ† Ù†ÛŒØ² Ù‡Ø³Øª.</p><p>R Ù‚Ø§Ø¨Ù„ÛŒØª ÙÙˆÙ‚ Ø§Ù„Ø¹Ø§Ø¯Ù‡ Ø§ÛŒ Ø¨Ø±Ø§ÛŒ ØªÙØ³ÛŒØ± Ø¯Ø§Ø¯Ù‡ Ù‡Ø§ Ø¯Ø§Ø±Ø¯ØŒ Ø¨Ø³ÛŒØ§Ø±ÛŒ Ø§Ø² Ø§Ù„Ú¯ÙˆØ±ÛŒØªÙ… Ù‡Ø§ÛŒ ÛŒØ§Ø¯Ú¯ÛŒØ±ÛŒ Ù…Ø§Ø´ÛŒÙ† Ø±Ø§ Ù…ÛŒØªÙˆØ§Ù† Ø¯Ø± R Ø§Ø¬Ø±Ø§ Ú©Ø±Ø¯.</p><p><strong>6.Ø¬Ø§ÙˆØ§ Ø§Ø³Ú©Ø±ÛŒÙ¾Øª&nbsp;</strong><strong>(Java Script)</strong></p><p>Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø¨Ø±Ø§ÛŒ ØªÙˆØ³Ø¹Ù‡ ÙˆØ¨ Ù…ÙˆØ±Ø¯ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ù‚Ø±Ø§Ø± Ù…ÛŒÚ¯ÛŒØ±Ø¯ Ùˆ Ù…Ø­Ø¨ÙˆØ¨ÛŒØª Ø¢Ù† Ù‡Ù…Ú†Ù†Ø§Ù† Ø§Ø¯Ø§Ù…Ù‡ Ø¯Ø§Ø±Ø¯. Ø§Ù…Ø±ÙˆØ²Ù‡ Ù‡Ø± Ú©Ø³Ø¨ Ùˆ Ú©Ø§Ø± Ø¨Ù‡ ÛŒÚ© Ø³Ø§ÛŒØª Ù†ÛŒØ§Ø² Ø¯Ø§Ø±Ø¯ Ú©Ù‡ Ø¨Ø±Ø§ÛŒ Ø§ÛŒØ¬Ø§Ø¯ Ø³Ø§ÛŒØª Ù†ÛŒØ² Ø¬Ø§ÙˆØ§ Ø§Ø³Ú©Ø±ÛŒÙ¾Øª Ø§Ø³Ø§Ø³ÛŒ Ø§Ø³Øª. Ù‡Ø± ÙØ§ÛŒÙ„ Ø¬Ø§ÙˆØ§ Ø§Ø³Ú©Ø±ÛŒÙ¾Øª Ø¨Ø§ Ù¾Ø³ÙˆÙ†Ø¯. JS Ø°Ø®ÛŒØ±Ù‡ Ùˆ Ø´Ø§Ù…Ù„ ØªÙ…Ø§Ù… Ø§Ø´ÛŒØ§ Head,Body Ùˆ HTML Ø¯Ø± ØªÚ¯ Ù‡Ø§ÛŒ ØµÙØ­Ù‡ Ø§Ú† ØªÛŒ Ø§Ù… Ø§Ù„ Ø§Ø³Øª. Ù¾Ø³ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ù†Ú©Ø±Ø¯Ù† Ø§Ø² Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø¯Ø± Ù¾Ø±ÙˆÚ˜Ù‡ Ù…ÛŒØªÙˆØ§Ù†Ø¯ Ø¶Ø¹Ù Ø³Ø§ÛŒØª Ø´Ù…Ø§ Ø±Ø§ Ù†Ø´Ø§Ù† Ø¯Ù‡Ø¯.</p><p><strong>7.Ù¾ÛŒ Ø§Ú† Ù¾ÛŒ&nbsp;</strong><strong>(PHP)</strong></p><p>Ù¾ÛŒ Ø§Ú† Ù¾ÛŒ Ø¨Ù‡ Ù„Ø·Ù ÙˆØ±Ø¯Ù¾Ø±Ø³ Ø¨Ø³ÛŒØ§Ø± Ù…Ø´Ù‡ÙˆØ± Ø§Ø³Øª. Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ù…Ù†Ø­ØµØ± Ø¨Ù‡ ÙØ±Ø¯ Ø¨Ù‡ Ù†ÙˆØ¹ÛŒ Ø¯Ø± Ø¨ÛŒØ´ØªØ± Ø³Ø§ÛŒØª Ù‡Ø§ Ù…ÙˆØ±Ø¯ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ù‚Ø±Ø§Ø± Ù…ÛŒÚ¯ÛŒØ±Ø¯ Ùˆ Ø¨Ø³ÛŒØ§Ø± Ù†ÛŒØ² Ú©Ø§Ø±Ø¨Ø±Ø¯ÛŒ Ø§Ø³Øª.</p><p>ÙˆÛŒÚ©ÛŒ Ù¾Ø¯ÛŒØ§ Ùˆ ÙÛŒØ³Ø¨ÙˆÚ© Ø§Ø² Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø§Ø³ØªÙØ§Ø¯Ù‡ Ù…ÛŒÚ©Ù†Ù†Ø¯ Ùˆ Ø´Ù…Ø§ Ù†ÛŒØ² Ù‚Ø·Ø¹Ø§ Ù‚Ø¯Ø±Øª Ø¢Ù†Ù‡Ø§ Ø±Ø§ Ø­Ø³ Ú©Ø±Ø¯Ù‡ Ø§ÛŒØ¯.</p><p>Ø§Ø³ØªØ§Ù†Ø¯Ø§Ø±Ø¯Ù‡Ø§ÛŒ Ø³Ø®ØªÛŒ Ø¨Ø±Ø§ÛŒ Ù…ØªØ¯ÙˆÙ„ÙˆÚ˜ÛŒ Ø¯Ø± Ø³Ø§Ø®ØªÙ† ÙˆÛŒÚ˜Ú¯ÛŒ Ù‡Ø§ ÙˆØ¬ÙˆØ¯ Ù†Ø¯Ø§Ø±Ø¯ Ùˆ Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø¯Ø± Ø³Ø§Ø²Ú¯Ø§Ø±ÛŒ Ø¨Ø§ Ù…Ø³Ø§Ø¦Ù„ØŒ Ø®ÙˆØ¨ Ø¬ÙˆØ§Ø¨ Ø¯Ø§Ø¯Ù‡ Ø§Ø³Øª.</p><p>Ø¹Ù„Ø§ÙˆÙ‡ Ø¨Ø± Ø§ÛŒÙ† Ù¾ÛŒ Ø§Ú† Ù¾ÛŒ Ø¨Ø§ Ø¨Ø³ÛŒØ§Ø±ÛŒ Ø§Ø² Ú†Ø§Ø±Ú†ÙˆØ¨ Ù‡Ø§ÛŒ Ù…Ø¹Ø±ÙˆÙ Ù…Ø¯ÛŒØ±ÛŒØª Ù…Ø­ØªÙˆØ§ Ù…ÙˆØ±Ø¯ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ù‚Ø±Ø§Ø± Ù…ÛŒÚ¯ÛŒØ±Ø¯.</p><p>Ù¾Ø³ Ø¨Ø§ Ø§ÛŒÙ† ÙˆØ¬ÙˆØ¯ØŒ Ø¨Ø±Ø§ÛŒ ØªÙˆØ³Ø¹Ù‡ ÙˆØ¨ØŒ ÛŒØ§Ø¯Ú¯ÛŒØ±ÛŒ Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† ÙˆØ§Ø¬Ø¨ Ùˆ Ø§Ù„Ø²Ø§Ù…ÛŒ Ù…ÛŒØ¨Ø§Ø´Ø¯.</p><p>Ø´Ù…Ø§ Ø¨Ø§ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ø§Ø² Ù¾ÛŒ Ø§Ú† Ù¾ÛŒ&nbsp; Ù…ÛŒØªÙˆØ§Ù†ÛŒØ¯ Ø³Ø§ÛŒØª Ù‡Ø§ÛŒ Ù¾ÙˆÛŒØ§ØŒ Ø®ÛŒØ±Ù‡ Ú©Ù†Ù†Ø¯Ù‡ Ùˆ Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù‡Ø§ÛŒ Ú©Ø§Ø±Ø¨Ø±Ø¯ÛŒ ÙˆØ¨ Ø±Ø§ Ø§ÛŒØ¬Ø§Ø¯ Ú©Ù†ÛŒØ¯. Ù‡Ù…Ú†Ù†ÛŒÙ† Ù…ÛŒØªÙˆØ§Ù† Ø¯Ø± Ø³Ø±Ù…Ø§ÛŒÙ‡ Ú¯Ø°Ø§Ø±ÛŒ Ù‡Ø§ÛŒ Ù…Ø®ØªÙ„Ù ØªÙˆØ³Ø¹Ù‡ ÙˆØ¨ Ø§Ø² Ø¬Ù…Ù„Ù‡ ØªÙˆØ³Ø¹Ù‡ Ù†Ø±Ù… Ø§ÙØ²Ø§Ø± Ù…ÙˆØ¨Ø§ÛŒÙ„ Ùˆ ØªØ¬Ø§Ø±Øª Ø§Ù„Ú©ØªØ±ÙˆÙ†ÛŒÚ© Ø§Ø² Ù¾ÛŒ Ø§Ú† Ù¾ÛŒ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ú©Ù†ÛŒØ¯.</p><p><strong>8.Ú©Ø§ØªÙ„ÛŒÙ† (</strong><strong>Kotlin)</strong></p><p>Ù‡ÛŒÚ† Ú¯Ø²ÛŒÙ†Ù‡ Ø§ÛŒ Ø¨Ù‡ØªØ± Ø§Ø² ÛŒØ§Ø¯Ú¯ÛŒØ±ÛŒ Ø²Ø¨Ø§Ù† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ú©Ø§ØªÙ„ÛŒÙ† Ø¨Ø±Ø§ÛŒ ØªÙˆØ³Ø¹Ù‡ Ø¨Ø±Ù†Ø§Ù…Ù‡ Android Ø¯Ø± Ø³Ø§Ù„ 2018 ÙˆØ¬ÙˆØ¯ Ù†Ø¯Ø§Ø±Ø¯. Ø§Ø­ØªÙ…Ø§Ù„Ø§ Ù…ÙˆØ¶ÙˆØ¹ Ø¨Ø²Ø±Ú¯ Ø¨Ø¹Ø¯ÛŒ Ø¯Ø± Ø¬Ù‡Ø§Ù† Ø¨Ø±Ø§ÛŒ ØªØºÛŒÛŒØ±ØŒ Ø§Ù†Ø¯Ø±ÙˆÛŒØ¯ Ø§Ø³Øª.</p><p>Ø¨Ø§ ÙˆØ¬ÙˆØ¯ Ø§ÛŒÙ†Ú©Ù‡ Ø²Ø¨Ø§Ù† Ø¬Ø§ÙˆØ§ Ø¨Ø³ÛŒØ§Ø± Ù…Ø­Ø¨ÙˆØ¨ Ø§Ø³Øª Ø§Ù…Ø§ Ú©Ø§ØªÙ„ÛŒÙ† Ø¨Ø§ ÙˆÛŒÚ˜Ú¯ÛŒ Ù‡Ø§ÛŒØ´ Ùˆ IDE Ù‡Ø§ÛŒ Ù…ØªØ¹Ø¯Ø¯ÛŒ Ù…Ø§Ù†Ù†Ø¯ Ø§Ù†Ø¯Ø±ÙˆÛŒØ¯ Ø§Ø³ØªÙˆØ¯ÛŒÙˆ Ùˆ &nbsp;IntelliJ IDEA Ú©Ù‡ Ø§Ø² Ø¢Ù† Ù¾Ø´ØªÛŒØ¨Ø§Ù†ÛŒ Ù…ÛŒÚ©Ù†Ù†Ø¯ Ø¨Ø³ÛŒØ§Ø± Ø¨Ù‡ØªØ± Ø§Ø³Øª.</p><p><strong>9.Ø±Ø§Ø³Øª&nbsp;</strong><strong>(Rust)</strong></p><p>Ø±Ø§Ø³Øª ÛŒÚ© Ø²Ø¨Ø§Ù† Ø¬Ù‡Ø§Ù†ÛŒ Ø§Ø³Øª Ú©Ù‡ ØªÙˆØ³Ø¹Ù‡ Ø¯Ù‡Ù†Ø¯Ú¯Ø§Ù† Ø±Ø§ Ù‚Ø§Ø¯Ø± Ù…ÛŒ Ø³Ø§Ø²Ø¯ ØªØ§ Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù‡Ø§ÛŒ Ø³Ø±ÛŒØ¹ Ùˆ Ø§Ù…Ù† Ø±Ø§ Ú©Ù‡ Ø§Ø² Ø¨Ø±Ø¬Ø³ØªÙ‡ ØªØ±ÛŒÙ† Ù…Ø¨Ø§Ø­Ø« Ù¾Ø±Ø¯Ø§Ø²Ù†Ø¯Ù‡ Ù‡Ø§ÛŒ Ú†Ù†Ø¯ Ù‡Ø³ØªÙ‡ Ø§ÛŒ Ø¨Ø±Ø®ÙˆØ±Ø¯Ø§Ø± Ø¨Ø§Ø´Ù†Ø¯ØŒ Ø¨Ù‡ Ú©Ø§Ø± Ú¯ÛŒØ±Ù†Ø¯.</p><p>Ù‡Ù…Ú†Ù†ÛŒÙ† Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø¨Ø§ Ø§Ø±Ø²Ø´ ØªØ±ÛŒÙ† Ø²Ø¨Ø§Ù† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ø¯Ø± StackOverflow Ø¯Ø± Ø³Ø§Ù„ 2017 Ø¨ÙˆØ¯Ù‡ Ø§Ø³Øª Ú©Ù‡ Ø¨Ù‡ Ø§Ù†Ø¯Ø§Ø²Ù‡ proof.locales Ø§Ø² Dropbox Ùˆ Coursera Ø§Ø³ØªÙØ§Ø¯Ù‡ Ú©Ø±Ø¯Ù‡ Ø§Ø³Øª.</p><p><strong>10.Ø±ÙˆØ¨ÛŒ&nbsp;</strong><strong>(</strong><strong>Ruby)</strong></p><p>ÛŒÚ©ÛŒ Ø§Ø² Ø³Ø±ÛŒØ¹ØªØ±ÛŒÙ† Ø²Ø¨Ø§Ù† Ù‡Ø§ÛŒ Ø¯Ø±Ø­Ø§Ù„ ØªÙˆØ³Ø¹Ù‡&nbsp; Ruby &nbsp;Ø§Ø³Øª. Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø´ÛŒ Ú¯Ø±Ø§ Ù…ÛŒØ¨Ø§Ø´Ø¯ Ùˆ Ø¨Ø±Ø§ÛŒ Ø§ÙØ±Ø§Ø¯ data-hungry Ø³Ø§Ø®ØªÙ‡ Ø´Ø¯Ù‡ Ø§Ø³Øª. Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø¨Ø³ÛŒØ§Ø± Ø¢Ø³Ø§Ù† Ø¨Ø±Ø§ÛŒ Ø§Ø¬Ø±Ø§ Ú©Ø±Ø¯Ù† Ø§Ø³Øª Ú©Ù‡ Ø´Ù…Ø§ ØªÙ†Ù‡Ø§ Ø¯Ø± Ù…Ø¯Øª Ø²Ù…Ø§Ù† 10 Ø¯Ù‚ÛŒÙ‚Ù‡ Ù…ÛŒØªÙˆØ§Ù†ÛŒØ¯ ÛŒÚ© Ø¨Ø±Ù†Ø§Ù…Ù‡ Ø¨Ø³Ø§Ø²ÛŒØ¯!</p><p>Ø¯Ø± Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Groupon Ùˆ Airbnb Ùˆ Bloomberg Ùˆ Pxlr Ù‡Ù…Ù‡ Ú©Ø¯ Ø´Ø¯Ù‡ Ø§Ù†Ø¯.</p><p>Ø¯Ø± Ø§Ú©Ø«Ø± Ù…ÙˆØ§Ù‚Ø¹ Ù†ÛŒØ§Ø² Ø¯Ø§Ø±ÛŒØ¯ ØªØ§ Ø¨Ø§ Ú©Ø¯Ù‡Ø§ÛŒ Ø³Ø§ÛŒØª Ù‡Ø§ÛŒ Ù…Ø­Ø¨ÙˆØ¨ Ø¯ÛŒØªØ§Ø¨ÛŒØ³ Ø®ÙˆØ¯ Ø±Ø§ Ú©Ù†ØªØ±Ù„ Ú©Ù†ÛŒØ¯.Ø¨Ø§ Ú¯Ø°Ø´Øª Ø²Ù…Ø§Ù† Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø´Ù‡Ø±Øª Ø²ÛŒØ§Ø¯ÛŒ Ø±Ø§ Ú©Ø³Ø¨ Ø®ÙˆØ§Ù‡Ø¯ Ú©Ø±Ø¯.</p><p><strong>11.Ú¯ÙˆÚ¯Ù„ Ú¯Ùˆ (</strong><strong>Google Go)</strong></p><p>Google go Ø¯Ø± Ú©Ù†ØªØ±Ù„ Ú©Ø±Ø¯Ù† Ø¨Ø§Ø²Ø§Ø± Ù¾ÛŒØ´Ø±ÙØª Ø®ÙˆØ¨ÛŒ Ø¯Ø§Ø±Ø¯. Go ÛŒÚ© Ø²Ø¨Ø§Ù† ØªÙ„ÙÛŒÙ‚ÛŒ Ø§Ø³Øª Ùˆ Ø§Ø² Ø·Ø±ÛŒÙ‚ Ø¢Ø²Ù…Ø§ÛŒØ´ Ú©Ø¯ Ø³Ø§Ø®ØªÙ‡ Ø´Ø¯Ù‡ Ø¯Ø± Ú†Ù†Ø¯ Ø«Ø§Ù†ÛŒÙ‡ Ø¨Ø§Ø¹Ø« Ù…Ø´Ù‡ÙˆØ± Ø´Ø¯Ù† Ø¢Ù† Ù…ÛŒØ´ÙˆØ¯. Ø§ÛŒÙ† Ù…Ø´Ú©Ù„Ø§ØªÛŒ Ø±Ø§ Ø¯Ø± Ù…ÙˆØ±Ø¯ Ø´Ø±Ø§ÛŒØ· Ù…Ø­Ø§Ø³Ø¨Ø§Øª Ú†Ù†Ø¯ Ù¾Ø±Ø¯Ø§Ø²Ù†Ø¯Ù‡ &nbsp;Ù…Ø·Ø±Ø­ Ù…ÛŒÚ©Ù†Ø¯. Ø¯Ø± Ø¹Ø±Ø¶ Ú†Ù†Ø¯ Ø³Ø§Ù„ Ø¨Ø§Ø²Ø§Ø± Ø¢Ù† Ø¨Ù‡ Ø·ÙˆØ± Ú†Ø´Ù…Ú¯ÛŒØ±ÛŒ Ø§ÙØ²Ø§ÛŒØ´ Ù¾ÛŒØ¯Ø§ Ù…ÛŒÚ©Ù†Ø¯.</p><p><strong>12.Ø³ÛŒ Ø´Ø§Ø±Ù¾ (</strong><strong>C#)</strong></p><p>Ø¨Ø®Ø´ Ø¨Ø§Ø²ÛŒ Ø¨Ø§ Ø²Ø¨Ø§Ù† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ C# Ù…Ø¨Ø§Ø¯Ù„Ù‡ Ø´Ø¯Ù‡ Ø§Ø³ØªØŒ Ø²ÛŒØ±Ø§ Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† ÙˆÛŒÚ˜Ú¯ÛŒ Ù‡Ø§ÛŒ Ø¨Ø³ÛŒØ§Ø± Ø¬Ø§Ù„Ø¨ÛŒ Ø¯Ø§Ø±Ø¯. Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø¨Ù‡ Ø¢Ø±Ø§Ù…ÛŒ Ø¯Ø± Ø­Ø§Ù„ Ø§Ø² Ø¯Ø³Øª Ø¯Ø§Ø¯Ù† Ù…Ø­Ø¨ÙˆØ¨ÛŒØª Ø®ÙˆØ¯ Ø§Ø³Øª Ø¨Ù‡ Ù‡Ù…ÛŒÙ† Ø¯Ù„ÛŒÙ„ Ø§Ø³Øª Ú©Ù‡ Ø¢Ù† Ø±Ø§ Ø¯Ø± Ù†Ù‚Ø·Ù‡ Ø¯ÙˆØ§Ø²Ø¯Ù‡Ù… Ù‚Ø±Ø§Ø± Ø¯Ø§Ø¯Ù‡ Ø§ÛŒÙ…. Ø¯Ø± Ù‡Ø± ØµÙˆØ±Øª Ø¯Ø± Ø¢ÛŒÙ†Ø¯Ù‡ C# Ø²Ø±Ù‚ Ùˆ Ø¨Ø±Ù‚ Ø¨Ø³ÛŒØ§Ø±ÛŒ ÙˆØ¬ÙˆØ¯ Ø¯Ø§Ø±Ø¯ Ùˆ ÙˆØ¬ÙˆØ¯ Ø§Ø³Ù… Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø¯Ø± Ø±Ø²ÙˆÙ…Ù‡ Ø´Ù…Ø§ Ø¯Ø± Ø³Ø§Ù„ 2018 Ø¨Ù‡ Ø´Ù…Ø§ Ú©Ù…Ú© Ø´Ø§ÛŒØ§Ù†ÛŒ Ù…ÛŒÚ©Ù†Ø¯ØŒ Ù‡Ù…ÛŒÙ†Ø·ÙˆØ± Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø¨Ù‡ Ø¹Ù†ÙˆØ§Ù† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù‡Ø§ÛŒ ØªØ­Øª Ú©Ù†ØªØ±Ù„ Ø³ÛŒØ³ØªÙ… Ù‡Ø§ÛŒ Ø¯Ø§Øª Ù†Øª (.NET) Ø¹Ù…Ù„ Ù…ÛŒÚ©Ù†Ø¯.</p><p>Ø¨Ù‡ Ø§ÛŒÙ† ØªØ±ØªÛŒØ¨ Ø§Ú¯Ø± Ù…ÛŒØ®ÙˆØ§Ù‡ÛŒØ¯ ÙˆØ§Ø±Ø¯ Ø¨Ø§Ø²Ø§Ø± Ø³ÛŒ Ø´Ø§Ø±Ù¾ Ø´ÙˆÛŒØ¯ Ø§Ø·Ù…ÛŒÙ†Ø§Ù† Ø¯Ø§Ø´ØªÙ‡ Ø¨Ø§Ø´ÛŒØ¯ Ú©Ù‡ Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø¨Ù‡ØªØ±ÛŒÙ† Ø§Ø³Øª.</p><p>Ù‡Ù…Ú†Ù†ÛŒÙ† Ø³ÛŒ Ø´Ø§Ø±Ù¾ Ø¨ÛŒØ´ØªØ±ÛŒÙ† Ø²Ø¨Ø§Ù† ØªÙˆØµÛŒÙ‡ Ø´Ø¯Ù‡ Ø¨Ø±Ø§ÛŒ Ø¨Ø§Ø²ÛŒ Ø³Ø§Ø²ÛŒ Ø¨Ø§ unity Ø§Ø³Øª.</p><p><strong>Ù†ØªÛŒØ¬Ù‡</strong></p><p>Ø§Ù†ØªØ®Ø§Ø¨ Ø²Ø¨Ø§Ù† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ø¯Ø±Ø³Øª ÛŒÚ© Ø±ÙˆÛŒÚ©Ø±Ø¯ Ù‚Ø§Ø¨Ù„ ØªÙˆØ¬Ù‡ Ø§Ø³Øª ÙˆØ´Ù…Ø§ Ø¨Ø§ÛŒØ¯ ÛŒÚ© Ø¯ÛŒØ¯Ú¯Ø§Ù‡ Ù…Ù†Ø·Ù‚ÛŒ Ø¨Ø±Ø§ÛŒ Ù‡Ø¯ÙØªØ§Ù† Ø¯Ø§Ø´ØªÙ‡ Ø¨Ø§Ø´ÛŒØ¯ ØªØ§ Ø¨ØªÙˆØ§Ù†ÛŒØ¯ Ø¨Ù‡ Ø¨Ù‡ Ù‡Ø¯ÙØªØ§Ù† Ø¯Ø³Øª ÛŒØ§Ø¨ÛŒØ¯.</p><p>ØªÙˆØ¬Ù‡ Ø¯Ø§Ø´ØªÙ‡ Ø¨Ø§Ø´ÛŒØ¯ Ø§Ú¯Ø± Ø²Ø¨Ø§Ù†ÛŒ Ø±Ø§ Ø§Ù†ØªØ®Ø§Ø¨ Ú©Ø±Ø¯ÛŒØ¯ Ø­ØªÙ…Ø§ Ø¢Ø´Ù†Ø§ Ùˆ Ø¨Ù‡ Ø§Ù†Ø¯Ø§Ø²Ù‡ Ú©Ø§ÙÛŒ Ù‚Ø§Ø¨Ù„ÛŒØª Ø§Ù†Ø·Ø¨Ø§Ù‚ Ø¨Ø±Ø§ÛŒ Ù†ÛŒØ§Ø² Ù‡Ø§ÛŒ Ù…Ø®ØªÙ„Ù Ø±Ø§ Ø¯Ø§Ø±Ø§ Ø¨Ø§Ø´Ø¯.</p><p>Ø§Ù…ÛŒØ¯ÙˆØ§Ø±Ù… Ø¨Ø§ Ù…Ø·Ø§Ù„Ø¹Ù‡ Ø§ÛŒÙ† Ù¾Ø³Øª ØªÙˆØ§Ù†Ø³ØªÙ‡ Ø¨Ø§Ø´ÛŒØ¯ Ú©Ù‡ Ø²Ø¨Ø§Ù† Ù…ÙˆØ±Ø¯ Ù†Ø¸Ø± Ø®ÙˆØ¯ Ø±Ø§ Ø§Ù†ØªØ®Ø§Ø¨ Ùˆ Ø´Ø±ÙˆØ¹ Ø¨Ù‡ ÛŒØ§Ø¯Ú¯ÛŒØ±ÛŒ Ø¢Ù† Ú©Ù†ÛŒØ¯.</p>', '2019-03-25 08:39:39', '1'),
(17, 'Ø¨Ø±ØªØ±ÛŒÙ† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³Ø§Ù† ØªØ§Ø±ÛŒØ®', 'k.jpg', '<p><a href=\"http://advertis.blogfa.com/post/2/%d8%a8%d8%b1%d8%aa%d8%b1%db%8c%d9%86-%d8%a8%d8%b1%d9%86%d8%a7%d9%85%d9%87-%d9%86%d9%88%db%8c%d8%b3%d8%a7%d9%86-%d8%aa%d8%a7%d8%b1%db%8c%d8%ae\">Ø¨Ø±ØªØ±ÛŒÙ† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³Ø§Ù† ØªØ§Ø±ÛŒØ®</a></p><p>Ada Lovelace&nbsp;<br />Ada/Algorithm for the analytical engine (1843)</p><p>&nbsp;</p><p>Ø¢Ø¯Ø§ Ù„Ø§ÙˆÙ„ÛŒØ³ (Ø¯Ø®ØªØ± Ù¾Ø§ÙˆÙ„ Ù„Ø±Ø¯ Ø¨Ø¨Ø§ÛŒØ±ÙˆÙ†) Ø¯Ø± 10 Ø¯Ø³Ø§Ù…Ø¨Ø± 1815 Ø¯Ø± Ù„Ù†Ø¯Ù† Ø¨Ø¯Ù†ÛŒØ§ Ø¢Ù…Ø¯. Ø§Ùˆ ØªÙˆØ¶ÛŒØ­Ø§ØªÛŒ Ø¯Ø± Ø®ØµÙˆØµ Ù…Ø§Ø´ÛŒÙ† Ù…Ø­Ø§Ø³Ø¨Ø§ØªÛŒ Ù…Ú©Ø§Ù†ÛŒÚ©ÛŒ Ú†Ø§Ø±Ù„Ø² Ø¨Ø§Ø¨ÛŒØ¬ Ø§Ø±Ø§Ø¦Ù‡ Ù†Ù…ÙˆØ¯ Ùˆ ØªÙˆØ§Ù†Ø³Øª Ø§Ù„Ú¯ÙˆØ±ÛŒØªÙ…ÛŒ Ú©Ø§Ø±Ø¨Ø±Ø¯ÛŒ Ø¨Ø±Ø§ÛŒ Ø¢Ù† Ù¾ÛŒØ§Ø¯Ù‡ Ø³Ø§Ø²ÛŒ Ú©Ù†Ø¯ØŒ Ø¨Ø¯ÛŒÙ† Ø¯Ù„ÛŒÙ„ Ù†Ø®Ø³ØªÛŒÙ† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ Ø¬Ù‡Ø§Ù† Ù„Ù‚Ø¨ Ú¯Ø±ÙØª Ùˆ Ø²Ø¨Ø§Ù† Ø¢Ø¯Ø§ Ø±Ø§ Ø§Ø¨Ø¯Ø§Ø¹ Ù†Ù…ÙˆØ¯ .</p><p>&nbsp;</p><p>Alan Turing<br />Turing Machine (1937)</p><p>&nbsp;</p><p>Ø¢Ù‚Ø§ÛŒ Ø¢Ù„Ø§Ù† ØªÙˆØ±ÛŒÙ†Ú¯ØŒ Ø±ÙˆØ§Ù„ Ùˆ Ù¾Ø±ÙˆØ³Ù‡ Ù‚Ø§Ø¨Ù„ ØªÙˆØ¬Ù‡ Ø§ÛŒ Ø±Ø§ ØªÙˆØ³Ø· Ù…Ø§Ø´ÛŒÙ† ØªÙˆØ±ÛŒÙ†Ú¯ Ø¨Ø±Ø§ÛŒ Ø®Ù„Ù‚ Ú©Ø§Ù…Ù¾ÛŒÙˆØªØ±Ù‡Ø§ÛŒ Ù…Ø¯Ø±Ù† Ø¨Ø¯ÙˆÛŒ Ø®Ù„Ù‚ Ù†Ù…ÙˆØ¯. Ø§Ùˆ Ø¨Ù‡ Ù…ÙÙ‡ÙˆÙ… Ø§Ù„Ú¯ÙˆØ±ÛŒØªÙ… Ùˆ Ù…Ø­Ø§Ø³Ø¨Ø§Øª Ø¨Ø§ Ù…Ø§Ø´ÛŒÙ† ØªÙˆØ±ÛŒÙ†Ú¯ Ú©Ù‡ Ù…Ø§Ø´ÛŒÙ† Ø§ØªÙˆÙ…Ø§ØªÛŒÚ© Ù†ÛŒØ² Ù†Ø§Ù…ÛŒØ¯Ù‡ Ù…ÛŒØ´Ø¯ Ø±Ø³Ù…ÛŒØª Ø¨Ø®Ø´ÛŒØ¯. ÛŒÚ© Ù…Ø§Ø´ÛŒÙ† ØªÙˆØ±ÛŒÙ†Ú¯ Ù…ÛŒ ØªÙˆØ§Ù†Ø¯ Ø§Ù‚ØªØ¨Ø§Ø³ Ù…Ù†Ø·Ù‚ÛŒ Ø§Ø² Ù‡Ø± Ø§Ù„Ú¯ÙˆØ±ÛŒØªÙ… Ú©Ø§Ù…Ù¾ÛŒÙˆØªØ±ÛŒ Ø±Ø§ Ø´Ø¨ÛŒÙ‡ Ø³Ø§Ø²ÛŒ Ú©Ø±Ø¯Ù‡ Ùˆ ÙˆÛŒÚ˜Ú¯ÛŒ Ù…ÙÛŒØ¯ÛŒ Ø±Ø§ Ø¨Ø±Ø§ÛŒ ØªØ´Ø±ÛŒØ­ ØªÙˆØ§Ø¨Ø¹ Ø¯Ø±ÙˆÙ†ÛŒ Ù¾Ø±Ø¯Ø§Ø²Ø´Ú¯Ø±&nbsp;(CPU)Ø§Ø±Ø§Ø¦Ù‡ Ù†Ù…Ø§ÛŒØ¯ .</p><p>&nbsp;</p><p>John von Neumann<br />von Neumann architecture (1945)</p><p>&nbsp;</p><p>Ø¬Ø§Ù† ÙÙˆÙ† Ù†ÙˆÛŒÙ…Ù† Ø®Ø§Ù„Ù‚ Ù…Ø¹Ù…Ø§Ø±ÛŒ&nbsp;Von Neumann&nbsp;Ø¨ÙˆØ¯Ù‡ Ùˆ Ø¯Ø± Ø·Ø±Ø§Ø­ÛŒ Ùˆ Ø³Ø§Ø®Øª Ø§ÙˆÙ„ÛŒÙ† Ú©Ø§Ù…Ù¾ÛŒÙˆØªØ± Ø¨Ù†Ø§Ù… Ø§ÛŒÙ†Ø§Ú© Ø³Ù‡Ù… Ù…Ù‡Ù…ÛŒ Ø¯Ø§Ø´ØªÙ‡ Ø§Ø³Øª. Ø§ÛŒÙ† Ù…Ø¹Ù…Ø§Ø±ÛŒ Ø¨Ø§Ø¹Ø« Ø°Ø®ÛŒØ±Ù‡ Ø³Ø§Ø²ÛŒ Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù‡Ø§ Ø¯Ø± Ø­Ø§ÙØ¸Ù‡ Ú©Ø§Ù…Ù¾ÛŒÙˆØªØ± Ù…ÛŒ Ø´ÙˆØ¯. Ø§ÛŒÙ† Ù†ÙˆØ¹ Ù…Ø¹Ù…Ø§Ø±ÛŒ Ù†Ø­ÙˆÙ‡ Ø§Ø³ØªÙØ§Ø¯Ù‡ ÛŒÚ© Ù¾Ø±Ø¯Ø§Ø²Ø´Ú¯Ø±&nbsp;(CPU)&nbsp;Ø§Ø² Ø­Ø§ÙØ¸Ù‡&nbsp;(Memory)&nbsp;Ú©Ø§Ù…Ù¾ÛŒÙˆØªØ± Ø¨Ø±Ø§ÛŒ Ø¯Ø±ÛŒØ§ÙØª Ùˆ Ù¾Ø±Ø¯Ø§Ø²Ø´ Ø³Ø§Ø®ØªØ§Ø±Ù‡Ø§ Ùˆ Ø¯Ø§Ø¯Ù‡ Ù‡Ø§ Ø±Ø§ Ù¾ÛŒØ§Ø¯Ù‡ Ø³Ø§Ø²ÛŒ Ù…ÛŒ Ú©Ù†Ø¯ .</p><p>&nbsp;</p><p>John W. Backus<br />FORTRAN (1954)</p><p>&nbsp;</p><p>Ù‚Ø¨Ù„ Ø§Ø² Ø§Ø¨Ø¯Ø§Ø¹ Ø²Ø¨Ø§Ù† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ ÙÙˆØ±ØªØ±Ù†ØŒ Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ø¨Ø³ÛŒØ§Ø± Ù…Ø´Ú©Ù„ Ùˆ Ø·Ø§Ù‚Øª ÙØ±Ø³Ø§ Ø¨ÙˆØ¯. Ø¬Ø§Ù† ÙˆØ§Ø±Ù†Ø± Ø¨Ú©ÙˆØ³ Ø¯Ø§Ù†Ø´Ù…Ù†Ø¯ÛŒ Ø¢Ù…Ø±ÛŒÚ©Ø§ÛŒÛŒ Ø¨ÙˆØ¯ Ùˆ Ø±Ù‡Ø¨Ø±ÛŒ Ú¯Ø±ÙˆÙ‡ÛŒ Ø±Ø§ Ø¨Ø±Ø¹Ù‡Ø¯Ù‡ Ø¯Ø§Ø´Øª Ú©Ù‡ Ø§ÙˆÙ„ÛŒÙ† Ø²Ø¨Ø§Ù† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ø³Ø·Ø­ Ø¨Ø§Ù„Ø§&nbsp;(high-level programming language)&nbsp;Ø±Ø§ Ø§ÛŒØ¬Ø§Ø¯ Ú©Ø±Ø¯Ù†Ø¯. Ù‡Ù…Ú†Ù†ÛŒÙ† Ù…Ø®ØªØ±Ø¹ ÙØ±Ù… Ø¨Ú©ÙˆØ³-Ù†Ø§Ø¦Ùˆ(BNF)&nbsp;Ù†ÛŒØ² Ø¨ÙˆØ¯ Ú©Ù‡ ØªÙ‚Ø±ÛŒØ¨Ø§ÙŒ Ù¾Ø± Ø§Ø³ØªÙØ§Ø¯Ù‡ ØªØ±ÛŒÙ† Ù†Ù…Ø§Ø¯Ú¯Ø± Ø¨Ø±Ø§ÛŒ ØªØ¹Ø±ÛŒÙ Ù†Ø­Ùˆ&nbsp;(Syntax)Ø²Ø¨Ø§Ù†Ù‡Ø§ÛŒ ØµÙˆØ±ÛŒ Ø§Ø³Øª .</p><p>&nbsp;</p><p>John McCarthy<br />Lisp (1958)</p><p>&nbsp;</p><p>Ù¾Ø±ÙˆÙØ³ÙˆØ± Ø¬Ø§Ù† Ù…Ú© Ú©Ø§Ø±ØªÛŒ Ø¯Ø± Ø³Ø§Ù„ 1917 Ø¯Ø± Ø¨ÙˆØ³ØªÙˆÙ† Ù…ØªÙˆÙ„Ø¯ Ø´Ø¯. Ùˆ Ø¯Ø± Ø²Ù…ÛŒÙ†Ù‡ Ù‡ÙˆØ´ Ù…ØµÙ†ÙˆØ¹ÛŒ ÙØ¹Ø§Ù„ÛŒØª Ú©Ø±Ø¯ Ùˆ Ø¯Ø± Ø³Ø§Ù„ 1958 Ø²Ø¨Ø§Ù† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ù„ÛŒÙ¾Ø³ Ø±Ø§ Ø§Ø¨Ø¯Ø§Ø¹ Ù†Ù…ÙˆØ¯. Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ù…Ø§Ù†Ù†Ø¯ Ø²Ø¨Ø§Ù† Ù¾Ø±ÙˆÙ„ÙˆÚ¯ Ø¨ÛŒØ´ØªØ± Ø¨Ø±Ø§ÛŒ Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ø¯Ø± Ø²Ù…ÛŒÙ†Ù‡ Ù‡ÙˆØ´ Ù…ØµÙ†ÙˆØ¹ÛŒ Ø¨Ú©Ø§Ø± Ú¯Ø±ÙØªÙ‡ Ø´Ø¯. Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø§Ø² Ù†Ø­Ùˆ Ø³Ø§Ø¯Ù‡ Ø§ÛŒ Ø¨Ø±Ø®ÙˆØ±Ø¯Ø§Ø± Ø§Ø³Øª Ùˆ ØªØ¬Ø²ÛŒÙ‡ Ùˆ Ù¾ÛŒØ§Ø¯Ù‡ Ø³Ø§Ø²ÛŒ Ù†Ø³Ø¨ØªØ§ÙŒ Ø¢Ø³Ø§Ù†ÛŒ Ø¯Ø§Ø±Ø¯ Ú©Ù‡ Ø§Ø² Ø§ÙˆÙ„ÛŒÙ† Ø²Ø¨Ø§Ù†Ù‡Ø§ÛŒ Ø³Ø·Ø­ Ø¨Ø§Ù„Ø§ Ù…Ø­Ø³ÙˆØ¨ Ù…ÛŒ Ø´ÙˆØ¯ .</p><p>&nbsp;</p><p>Donald Knuth<br />TeX (1978) and MMIX</p><p>&nbsp;</p><p>Ø¯ÙˆÙ†Ø§Ù„Ø¯ Ú©Ù†ÙˆØª Ø¯Ø§Ù†Ø´Ù…Ù†Ø¯ Ú©Ø§Ù„ÛŒÙØ±Ù†ÛŒØ§ÛŒÛŒ Ùˆ Ø¹Ù…Ù„Ø§ÙŒ Ù¾Ø§ÛŒÙ‡ Ú¯Ø°Ø§Ø± Ùˆ Ù¾Ø¯Ø± Ø¢Ù†Ø§Ù„ÛŒØ² Ø§Ù„Ú¯ÙˆØ±ÛŒØªÙ…Ù‡Ø§Ø³Øª Ùˆ Ø³Ù‡Ù… ÙØ±Ø§ÙˆØ§Ù†ÛŒ Ø¯Ø± Ú¯Ø³ØªØ±Ø´ Ù…Ø¨Ø§Ù†ÛŒ Ù†Ø¸Ø±ÛŒ Ø´Ø§Ø®Ù‡ Ù‡Ø§ÛŒ Ù…Ø®ØªÙ„Ù Ø¹Ù„ÙˆÙ… Ú©Ø§Ù…Ù¾ÛŒÙˆØªØ±ÛŒ Ø¯Ø§Ø±Ø¯. Ù‡Ù…Ú†Ù†ÛŒÙ† Ø·Ø±Ø§Ø­ Ø³ÛŒØ³ØªÙ… Ø­Ø±ÙˆÙÚ†ÛŒÙ† Tex Ùˆ Ø³Ø§Ù…Ø§Ù†Ù‡ Ø­Ø±ÙˆÙ ÙØ±Ø§Ù‚Ù„Ù…&nbsp;(MetaFont)&nbsp;Ùˆ Ù…Ø·Ø±Ø­ Ú©Ù†Ù†Ø¯Ù‡ Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ø§Ø¯Ø¨ÛŒØ§ØªØ§Ù†Ù‡ Ø§Ø³Øª .</p><p>&nbsp;</p><p>Ken Thompson and Dennis Ritchie<br />Unix (1969), B (1969) and C (1972) programming languages</p><p>&nbsp;</p><p>Ú©Ù† ØªØ§Ù…Ø³ÙˆÙ† Ùˆ Ø¯Ù†ÛŒØ³ Ù…Ú© Ø¢Ù„ÛŒØ³ØªØ± Ø±ÛŒÚ†ÛŒ Ø¯Ùˆ Ø¯Ø§Ù†Ø´Ù…Ù†Ø¯ Ø¢Ù…Ø±ÛŒÚ©Ø§ÛŒÛŒ Ù‡Ø³ØªÙ†Ø¯ Ú©Ù‡ Ø³ÛŒØ³ØªÙ… Ø¹Ø§Ù…Ù„ ÛŒÙˆÙ†ÛŒÚ©Ø³ Ø±Ø§ Ø·Ø±Ø§Ø­ÛŒ Ù†Ù…ÙˆØ¯Ù†Ø¯. Ø±ÛŒÚ†ÛŒ Ø¨Ù‡ Ù‡Ù…Ø±Ø§Ù‡ ÙØ±Ø¯ÛŒ Ø¯ÛŒÚ¯Ø± Ø¨Ù†Ø§Ù… Ø¨Ø±Ø§ÛŒØ§Ù† Ú©Ø±Ù†ÛŒÚ¯Ø§Ù† Ø²Ø¨Ø§Ù† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ C Ø±Ø§ Ø·Ø±Ø§Ø­ÛŒ Ú©Ø±Ø¯Ù†Ø¯. ØªØ§Ù…Ø³ÙˆÙ† Ù‡Ù… Ø²Ø¨Ø§Ù† B Ø±Ø§ Ù†ÙˆØ´Øª Ú©Ù‡ Ø³ÛŒØ³ØªÙ… Ø¹Ø§Ù…Ù„ Ù‡Ø§ÛŒÛŒ Ø¨Ø± Ø§Ø³Ø§Ø³ Ø§ÛŒÙ† Ø²Ø¨Ø§Ù†Ù‡Ø§ÛŒ Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ø·Ø±Ø§Ø­ÛŒ Ùˆ Ù¾ÛŒØ§Ø¯Ù‡ Ø³Ø§Ø²ÛŒ Ú¯Ø±Ø¯ÛŒØ¯ .</p><p>&nbsp;</p><p>Bjarne Stroustrup<br />C++ (~1983)</p><p>&nbsp;</p><p>Ø¨ÛŒ ÛŒØ§Ø±Ù†Ù‡ Ø§Ø³ØªØ±Ø§Ø³ ØªØ±ÙˆÙ¾ Ø¯Ø§Ù†Ø´Ù…Ù†Ø¯ÛŒ Ø¯Ø§Ù†Ù…Ø§Ø±Ú©ÛŒ Ø§Ø³Øª Ú©Ù‡ Ø®Ø§Ù„Ù‚ Ùˆ ØªÙˆØ³Ø¹Ù‡ Ø¯Ù‡Ù†Ø¯Ù‡ Ø²Ø¨Ø§Ù† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ù‡Ù…Ù‡ Ù…Ù†Ø¸ÙˆØ±Ù‡&nbsp;C++&nbsp;Ø§Ø³Øª Ú©Ù‡ Ø¨ÙˆØ§Ø³Ø·Ù‡ Ù‡Ù…ÛŒÙ† Ø²Ø¨Ø§Ù† Ø¯Ù†ÛŒØ§ÛŒ Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ø±Ø§ Ø¨Ø§ Ø¨Ú©Ø§Ø±Ú¯ÛŒØ±ÛŒ Ù…ÙØ§Ù‡ÛŒÙ… Ø´ÛŒ Ú¯Ø±Ø§ÛŒÛŒ Ø¯Ø± Ø²Ø¨Ø§Ù† C Ù…ØªØ­ÙˆÙ„ Ø³Ø§Ø®Øª. Ø§Ùˆ Ù‚Ø§Ø¨Ù„ÛŒØª Ù‡Ø§ÛŒ ÙØ±Ø§ÙˆØ§Ù†ÛŒ Ø¨Ù…Ø§Ù†Ù†Ø¯ Ú©Ù„Ø§Ø³ØŒ Ø´ÛŒØŒ Ø³Ø§Ø®ØªØ§Ø±Ù‡Ø§ØŒ ØªÙˆØ§Ø¨Ø¹ Ù…Ø¬Ø§Ø²ÛŒØŒ Ø³Ø±Ø¨Ø§Ø±Ú¯Ø°Ø§Ø±ÛŒ Ø¹Ù…Ù„Ú¯Ø±Ù‡Ø§ Ùˆ ... Ø±Ø§ Ø¨Ù‡ Ø²Ø¨Ø§Ù† C Ø§Ø¶Ø§ÙÙ‡ Ù†Ù…ÙˆØ¯ ØªØ§ Ø¯Ù†ÛŒØ§ÛŒ Ù…Ø¬Ø§Ø²ÛŒ Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ø±Ø§ Ú©Ø§Ù…Ù„Ø§ÙŒ Ù…Ù†Ø·Ø¨Ù‚ Ø¨Ø± Ø¯Ù†ÛŒØ§ÛŒ ÙˆØ§Ù‚Ø¹ÛŒ Ù¾ÛŒØ±Ø§Ù…ÙˆÙ† Ù…Ø§ Ø¨Ø³Ø§Ø²Ø¯ .</p><p>&nbsp;</p><p>Richard Brodie<br />Microsoft Word (1983)</p><p>&nbsp;</p><p>Ø±ÛŒÚ†Ø§Ø±Ø¯ Ø¨Ø±ÙˆØ¯ÛŒÙ‡ Ø¯Ø§Ù†Ø´Ù…Ù†Ø¯ÛŒ Ø¢Ù…Ø±ÛŒÚ©Ø§ÛŒÛŒ Ùˆ Ù‡ÙØªØ§Ø¯ÙˆÙ‡ÙØªÙ…ÛŒÙ† Ù†ÙØ± Ø§Ø³ØªØ®Ø¯Ø§Ù… Ø´Ø¯Ù‡ Ø¯Ø± Ø´Ø±Ú©Øª ØºÙˆÙ„ Ù…Ø§ÛŒÚ©Ø±ÙˆØ³Ø§ÙØª Ø¨ÙˆØ¯ Ú©Ù‡ Ù†Ø±Ù… Ø§ÙØ²Ø§Ø± Word Ø±Ø§ Ø¨Ø±Ø§ÛŒ Ø¢Ù† Ø´Ø±Ú©Øª Ø¨Ø§ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ø§Ø² Ø²Ø¨Ø§Ù† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ&nbsp;C++&nbsp;Ù†ÙˆØ´Øª. ÙˆÛŒ Ú†Ù†Ø¯ÛŒÙ† ØªØ§Ù„ÛŒÙ Ø¨Ø±Ø¬Ø³ØªÙ‡ Ø¯Ø± Ø²Ù…ÛŒÙ†Ù‡ Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ø¯Ø§Ø±Ø¯ .</p><p>&nbsp;</p><p>Richard Stallman<br />Emacs editor/Lead architect of the GNU project (1983)</p><p>&nbsp;</p><p>Ø±ÛŒÚ†Ø§Ø±Ø¯ Ø§Ø³ØªØ§Ù„Ù…Ù† ÛŒÚ© Ø¢Ù…Ø±ÛŒÚ©Ø§ÛŒÛŒ Ø·Ø±ÙØ¯Ø§Ø± Ù†Ø±Ù… Ø§ÙØ²Ø§Ø±Ù‡Ø§ÛŒ Ø¢Ø²Ø§Ø¯&nbsp;open Source&nbsp;Ùˆ Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ ØªÙˆØ§Ù†Ø§Ø³Øª. Ø§Ùˆ Ù¾Ø±ÙˆÚ˜Ù‡ GNU Ø±Ø§ Ø¨Ø±Ø§ÛŒ Ø³Ø§Ø®Øª Ø³ÛŒØ³ØªÙ… Ø¹Ø§Ù…Ù„ÛŒ Ú©Ø§Ù…Ù„Ø§ÙŒ Ø¢Ø²Ø§Ø¯ Ø´Ø¨ÛŒÙ‡ Ø¨Ù‡ ÛŒÙˆÙ†ÛŒÚ©Ø³ Ø¢ØºØ§Ø² Ù†Ù…ÙˆØ¯ Ùˆ Ù…Ø¯ÛŒØ±ÛŒØª Ùˆ Ù…Ø¹Ù…Ø§Ø±ÛŒ Ø§ÛŒÙ† Ù¾Ø±ÙˆÚ˜Ù‡ Ø±Ø§ Ø¨Ø±Ø¹Ù‡Ø¯Ù‡ Ú¯Ø±ÙØª. Ø¨Ø§ Ø¢ØºØ§Ø² Ø¨Ú©Ø§Ø± Ø§ÛŒÙ† Ù¾Ø±ÙˆÚ˜Ù‡ Ø§Ùˆ Ù†Ø®Ø³ØªÛŒÙ† Ù‚Ø¯Ù… Ø±Ø§ Ø¯Ø± Ø¬Ù†Ø¨Ø´ Ù†Ø±Ù… Ø§ÙØ²Ø§Ø±Ù‡Ø§ÛŒ Ø¢Ø²Ø§Ø¯ Ø¨Ø±Ø¯Ø§Ø´Øª Ùˆ Ø¯Ø± Ø§Ú©ØªØ¨Ø± 1985 Ø¨Ù†ÛŒØ§Ø¯ Ù†Ø±Ù… Ø§ÙØ²Ø§Ø±Ù‡Ø§ÛŒ Ø¢Ø²Ø§Ø¯ Ø±Ø§ Ø¨Ù†Ø§ Ù†Ù‡Ø§Ø¯ .</p><p>&nbsp;</p><p>Larry Wall<br />Perl (1987)</p><p>&nbsp;</p><p>Ù„Ø±ÛŒ ÙˆØ§Ù„ Ø³Ø§Ø²Ù†Ø¯Ù‡ Ùˆ Ø§Ø¨Ø¯Ø§Ø¹ Ú©Ù†Ù†Ø¯Ù‡ Ø²Ø¨Ø§Ù† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ù¾Ø±Ù„ Ø¯Ø± Ø³Ø§Ù„ 1987 Ø§Ø³Øª. Ù¾Ø±Ù„ Ø²Ø¨Ø§Ù† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ø§Ø³Øª Ú©Ù‡ Ø§Ù…Ø±ÙˆØ²Ù‡ Ø¨ÛŒØ´ØªØ± Ø¯Ø± Ø²Ù…ÛŒÙ†Ù‡ Ù‡Ø§ÛŒ Ù‡ÙˆØ´ Ù…ØµÙ†ÙˆØ¹ÛŒØŒ Ú˜Ù†ØªÛŒÚ©ØŒ Ù†Ø¸Ø§Ù…ÛŒØŒ ØªØ­Ù‚ÛŒÙ‚Ø§ØªÛŒ Ùˆ ØµÙ†Ø¹ØªÛŒ Ø¨Ø·ÙˆØ± Ú¯Ø³ØªØ±Ø¯Ù‡ Ø§ÛŒ Ú©Ø§Ø±Ø¨Ø±Ø¯ Ø¯Ø§Ø±Ø¯. Ø³Ø§Ø®ØªØ§Ø± Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø¨Ø±Ú¯Ø±ÙØªÙ‡ Ø§Ø² Ø²Ø¨Ø§Ù† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ&nbsp;C++&nbsp;Ø§Ø³Øª .</p><p>&nbsp;</p><p>Guido van Rossum a.k.a BDFL (Benevolent Dictator for Life)<br />Python (1989)</p><p>&nbsp;</p><p>Ú¯ÛŒØ¯Ùˆ ÙˆÙ† Ø±ÙˆØ³ÙˆÙ… Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ù‡Ù„Ù†Ø¯ÛŒ Ø§Ø³Øª Ùˆ Ø´Ù‡Ø±Øª ÙˆÛŒ Ø¨Ø®Ø§Ø·Ø± Ø§Ø¨Ø¯Ø§Ø¹ Ø²Ø¨Ø§Ù† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ù¾Ø§ÛŒØªÙˆÙ† Ø§Ø³Øª. Ù¾Ø§ÛŒØªÙˆÙ† Ø²Ø¨Ø§Ù† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ù‡Ù…Ù‡ Ù…Ù†Ø¸ÙˆØ±Ù‡ØŒ Ø³Ø·Ø­ Ø¨Ø§Ù„Ø§ØŒ Ø´ÛŒ Ú¯Ø±Ø§ØŒ Ùˆ Ù…ÙØ³Ø± Ø§Ø³Øª .</p><p>&nbsp;</p><p>Tim Berners-Lee and Robert Cailliau<br />HTTP, HTML, World Wide Web (www) (1990)</p><p>&nbsp;</p><p>Ø³Ø± ØªÛŒÙ…ÙˆØªÛŒ Ø¬Ø§Ù† Ø¨Ø±Ù†Ø²-Ù„ÛŒ Ø¯Ø§Ù†Ø´Ù…Ù†Ø¯ Ø§Ù†Ú¯Ù„ÛŒØ³ÛŒ Ú©Ø§Ù…Ù¾ÛŒÙˆØªØ± Ùˆ Ø§Ø³ØªØ§Ø¯ Ø¯Ø§Ù†Ø´Ú¯Ø§Ù‡ IT Ùˆ Ø±ÛŒØ§Ø³Øª Ú©Ù†Ø³Ø±Ø³ÛŒÙˆÙ… ÙˆØ¨ Ø¬Ù‡Ø§Ù† Ú¯Ø³ØªØ± Ø§Ø³Øª&nbsp;(www)&nbsp;Ùˆ ØªÚ©Ø§Ù…Ù„ ÙˆØ¨ Ø±Ø§ ØªØ­Øª Ù†Ø¸Ø± Ø¯Ø§Ø±Ø¯. Ø§Ùˆ Ù…Ø®ØªØ±Ø¹ WWW Ø§Ø³Øª Ú©Ù‡ Ù‡Ù…Ù‡ Ø¨Ù‡ Ø¨Ø²Ø±Ú¯ÛŒ Ùˆ Ø¹Ø¸Ù…Øª Ø¢Ù† ÙˆØ§Ù‚ÙÛŒÙ…. Ø§Ùˆ Ø¨Ù‡ Ú©Ù…Ú© Ø±Ø§Ø¨Ø±Øª Ú©ÛŒ Ù„ÛŒÙˆ Ø§Ø±ØªØ¨Ø§Ø· Ù…ÙˆÙÙ‚ÛŒØª Ø¢Ù…ÛŒØ²ÛŒ Ø¨ÛŒÙ† ÛŒÚ© Ù…ÛŒØ²Ø¨Ø§Ù† Ùˆ Ú©Ø§Ø±Ø¨Ø± HTTP Ø±Ø§ Ø§Ø² Ø·Ø±ÛŒÙ‚ Ø§ÛŒÙ†ØªØ±Ù†Øª Ø¨Ø±Ù‚Ø±Ø§Ø± Ù†Ù…ÙˆØ¯Ù†Ø¯ .</p><p>&nbsp;</p><p>Linus Torvalds<br />Linux Kernel /Git revision control system (1991)</p><p>&nbsp;</p><p>Ù„ÛŒÙ†ÙˆØ³ ØªÙˆØ±ÙˆØ§Ù„Ø¯Ø² Ù…Ù‡Ù†Ø¯Ø³ Ù†Ø±Ù… Ø§ÙØ²Ø§Ø± ÙÙ†Ù„Ø§Ø¯ÛŒ Ø§Ø³Øª Ú©Ù‡ Ø¨Ø§ Ø¢ØºØ§Ø² Ùˆ ØªÙˆØ³Ø¹Ù‡ Ù‡Ø³ØªÙ‡ Ù„ÛŒÙ†ÙˆÚ©Ø³ Ùˆ Ù‡Ù…Ú†Ù†ÛŒÙ† Ø³Ø§Ø®Øª Ù†Ø±Ù… Ø§ÙØ²Ø§Ø± Ú¯ÛŒØª Ø´Ù†Ø§Ø®ØªÙ‡ Ø´Ø¯Ù‡ Ø§Ø³Øª. ÙˆÛŒ Ø¯Ø± Ø­Ø¯ÙˆØ¯ 2% Ø§Ø² Ù‡Ø³ØªÙ‡ Ù„ÛŒÙ†ÙˆÚ©Ø³ Ø±Ø§ Ø´Ø®ØµØ§ÙŒ Ù†ÙˆØ´ØªÙ‡ Ú©Ù‡ ÛŒÚ©ÛŒ Ø§Ø² Ø²Ø¨Ø§Ù†Ù‡Ø§ÛŒ Ø¢Ø²Ø§Ø¯ Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ù…Ù‡Ù… Ø¯Ø± Ø³ÛŒØ³ØªÙ… Ø¹Ø§Ù…Ù„ Ø¨Ø´Ù…Ø§Ø± Ù…ÛŒ Ø±ÙˆØ¯ .</p><p>&nbsp;</p><p>John D. Carmack<br />Co-founder of id Software /Game programmer</p><p>&nbsp;</p><p>IT Software ÛŒÚ© Ú©Ù…Ù¾Ø§Ù†ÛŒ Ø¨Ø²Ø±Ú¯ ØªÙˆÙ„ÛŒØ¯ Ø¨Ø§Ø²ÛŒ Ø¯Ø± Ø¬Ù‡Ø§Ù† Ø§Ø³Øª Ú©Ù‡ Ø¬Ø§Ù† Ø¯ÛŒ Ú©Ø§Ø±Ù…Ú© ØªÙˆØ§Ù†Ø³Øª Ø¯Ø± Ø¢Ù†Ø¬Ø§ Ú¯Ø±Ø§ÙÛŒÚ© Ùˆ Ø§Ø¨Ø¹Ø§Ø¯ Ø±Ø§ Ø¨Ø·ÙˆØ± Ù…Ø­Ø´Ø±ÛŒ ÙˆØ§Ø±Ø¯ Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ù†Ù…Ø§ÛŒØ¯ Ùˆ Ø¨Ø§Ø²ÛŒ Ù‡Ø§ÛŒ&nbsp;3D&nbsp;Ø±Ø§ Ù¾Ø§ÛŒÙ‡ Ø±ÛŒØ²ÛŒ Ù†Ù…Ø§ÛŒØ¯ .</p><p>&nbsp;</p><p>Tim Sweeney<br />Founder of Epic Games/Unreal engine programmer</p><p>&nbsp;</p><p>ØªÛŒÙ… Ø³ÙˆÛŒÙ†ÛŒ ØªÙˆØ§Ù†Ø³Øª Ø¯Ø± Ø±Ù‚Ø§Ø¨ØªÛŒ Ø¯Ø± Ø²Ù…ÛŒÙ†Ù‡ Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ú¯Ø±Ø§ÙÛŒÚ©ÛŒ Ø¨Ø± Ú©Ø§Ø±Ù…Ú© Ù¾ÛŒØ±ÙˆØ² Ú¯Ø±Ø¯Ø¯ Ùˆ Ù…Ø¤Ø³Ø³ Ø´Ø±Ú©ØªÛŒ Ø¯Ø± Ø²Ù…ÛŒÙ†Ù‡ Ù…ÙˆØªÙˆØ± Ø·Ø±Ø§Ø­ÛŒ Ø¨Ø§Ø²ÛŒ Ù‡Ø§ÛŒ Ú¯Ø±Ø§ÙÛŒÚ©ÛŒ Ø§Ø³Øª. Ø§Ùˆ Ù†ÙˆÛŒØ³Ù†Ø¯Ù‡ Ù…Ù‚Ø§Ù„Ù‡ Ù…ÙˆØªÙˆØ±Ù‡Ø§ÛŒ ØºÛŒØ± ÙˆØ§Ù‚Ø¹ÛŒ Ø¯Ø± Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ù…ÛŒØ¨Ø§Ø´Ø¯. Ø§Ùˆ Ø¨Ø§ Ù…ÙˆÙÙ‚ÛŒØª ØªÙˆØ§Ù†Ø³Øª Ù¾Ø±Ø¯Ø§Ø²Ø´ ØªØµÙˆÛŒØ±ØŒ Ø±Ù†Ú¯ Ø¨Ù†Ø¯ÛŒ Ù¾ÙˆÛŒØ§ Ùˆ Ø§Ù†Ø¯Ø§Ø²Ù‡ Ø´Ù†Ø§Ø³ÛŒ ÙˆØ§Ù‚Ø¹ÛŒ Ø±Ø§ Ù¾ÛŒØ§Ø¯Ù‡ Ø³Ø§Ø²ÛŒ Ù†Ù…Ø§ÛŒØ¯ .</p><p>&nbsp;</p><p>James Gosling<br />Java (1995)</p><p>&nbsp;</p><p>Ø¬Ø§Ù†Ø² Ú¯Ø§Ø³Ù„ÛŒÙ†Ú¯ Ø±Ø§ Ù¾Ø¯Ø± Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ø¬Ø§ÙˆØ§&nbsp;JAVA&nbsp;Ù†Ø§Ù…Ù†Ø¯. Ø§Ùˆ Ø¬Ø§ÙˆØ§ Ø±Ø§ Ø²Ù…Ø§Ù†ÛŒ Ú©Ù‡ Ø¯Ø± Ø´Ø±Ú©Øª Sun Microsystems Ú©Ø§Ø± Ù…ÛŒ Ú©Ø±Ø¯ Ø§Ø¨Ø¯Ø§Ø¹ Ù†Ù…ÙˆØ¯. Ø¬Ø§ÙˆØ§ Ø§Ø² Ø²Ø¨Ø§Ù†Ù‡Ø§ÛŒ Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ø³Ø·Ø­ Ø¨Ø§Ù„Ø§ Ùˆ Ø¨Ø³ÛŒØ§Ø± Ù‚Ø¯Ø±ØªÙ…Ù†Ø¯ÛŒ Ø§Ø³Øª Ú©Ù‡ Ø³Ø§Ø®ØªØ§Ø± Ø®ÙˆØ¯ Ø±Ø§ Ø§Ø² C Ùˆ&nbsp;C++Ú¯Ø±ÙØªÙ‡ Ø§Ø³Øª Ø§Ù…Ø§ Ø¨Ø§ Ø§Ù…Ú©Ø§Ù†Ø§ØªÛŒ Ú©Ù…ØªØ± Ùˆ ØªÙˆØ§Ø¨Ø¹ÛŒ Ø³Ø§Ø¯Ù‡ ØªØ±. Ø§ÛŒÙ† Ø²Ø¨Ø§Ù† Ø§Ø² Ø§Ù…Ù†ÛŒØª Ø¨Ø³ÛŒØ§Ø± Ø¨Ø§Ù„Ø§ÛŒÛŒ Ø¨Ø±Ø®ÙˆØ±Ø¯Ø§Ø± Ù…ÛŒ Ø¨Ø§Ø´Ø¯ Ùˆ Ø¯Ø± Ø¢Ù…Ø±ÛŒÚ©Ø§ Ø·Ø±ÙØ¯Ø§Ø±Ø§Ù† Ø²ÛŒØ§Ø¯ÛŒ Ø¯Ø§Ø±Ø¯. Ø§Ùˆ Ù…Ø§Ø´ÛŒÙ† Ø¬Ø§ÙˆØ§ Ø±Ø§ Ù†ÛŒØ² Ø®ÙˆØ¯ Ù†ÙˆØ´Øª JRM .</p><p>&nbsp;</p><p>David Heinemeier Hansson<br />Ruby on Rails (2004)</p><p>&nbsp;</p><p>Ø¯ÛŒÙˆÛŒØ¯ Ù‡Ø§Ù†Ù…ÛŒØ± Ù‡Ø§Ù†Ø³ÙˆÙ† Ø³Ø§Ø²Ù†Ø¯Ù‡ Ùˆ Ø§Ø¨Ø¯Ø§Ø¹ Ú©Ù†Ù†Ø¯Ù‡ Ø²Ø¨Ø§Ù† Ø±Ø§Ø¨ÛŒ Ø¢Ù† Ø±ÛŒÙ„Ø²&nbsp;Ruby on Rails(ROR)&nbsp;Ù…ÛŒ Ø¨Ø§Ø´Ø¯ Ú©Ù‡ Ø´Ø±Ú©Øª Ø§Ù¾Ù„ Ø¯Ø± Ø¨Ø±Ø®ÛŒ Ø§Ø² Ù…Ø­ØµÙˆÙ„Ø§ØªØ´ Ø§Ø² Ø§ÛŒÙ† ØªÚ©Ù†ÙˆÙ„ÙˆÚ˜ÛŒ Ø¨Ù‡Ø±Ù‡ Ù…ÛŒ Ø¨Ø±Ø¯. Ø§ÛŒÙ† Ø²Ø¨Ø§Ù†ÛŒ Ø§Ø³Øª ØªØ­Øª ÙˆØ¨ Ùˆ Ø¢Ø²Ø§Ø¯ Ú©Ù‡ Ø¨Ø·ÙˆØ±ÛŒ Ø³Ø§Ø¯Ù‡ Ø¨Ù‡Ø±Ù‡ Ø¨Ø±ÛŒ ÙˆØ¨ Ø±Ø§ Ø§ÙØ²Ø§ÛŒØ´ Ù…ÛŒ Ø¨Ø®Ø´Ø¯ .</p><p>&nbsp;</p><p>Anders Hejlsberg<br />Turbo Pascal (1981), Delphi (1999), C#(~2000)</p><p>&nbsp;</p><p>Ø§Ù†Ø¯Ø±Ø³ Ù‡Ú¯Ù„Ø³Ø¨Ø±Ú¯ Ù…Ø¹Ù…Ø§Ø± ØªÙ…Ø§Ù…ÛŒ Ù†Ø³Ø®Ù‡ Ù‡Ø§ÛŒ Ú©Ø§Ù…Ù¾Ø§ÛŒÙ„Ø± ØªÙˆØ±Ø¨Ùˆ Ù¾Ø§Ø³Ú©Ø§Ù„ Ùˆ Ù‡Ù…Ú†Ù†ÛŒÙ† Ø³Ù‡ Ù†Ø³Ø®Ù‡ Ø§ÙˆÙ„ÛŒÙ‡ Ø¨ÙˆØ±Ù„Ù†Ø¯ Ø¯Ù„ÙÛŒ Ø§Ø³Øª Ùˆ Ø¯Ø± Ø­Ø§Ù„ Ø­Ø§Ø¶Ø± Ø¯Ø± Ø´Ø±Ú©Øª ØºÙˆÙ„ Ù…Ø§ÛŒÚ©Ø±Ùˆ Ø³Ø§ÙØª Ø±Ù‡Ø¨Ø± Ùˆ Ù…Ø¯ÛŒØ± Ú¯Ø±ÙˆÙ‡ Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ø³ÛŒ Ø´Ø§Ø±Ù¾&nbsp;C#&nbsp;Ù…ÛŒ Ø¨Ø§Ø´Ø¯ .</p><p>&nbsp;</p><p>Rasmus Lerdorf<br />PHP</p><p>&nbsp;</p><p>Ø±Ø§Ø³Ù…Ø§Ø³ Ù„Ø±Ø¯ÙˆÙ Ø¯Ø§Ù†Ù…Ø§Ø±Ú©ÛŒ Ø¨ÙˆØ¬ÙˆØ¯ Ø¢ÙˆØ±Ù†Ø¯Ù‡ Ø²Ø¨Ø§Ù† Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ù‡Ù…Ù‡ Ù…Ù†Ø¸ÙˆØ±Ù‡ PHP Ø§Ø³Øª Ú©Ù‡ ØªØ­Øª ÙˆØ¨ Ø§Ø³Øª Ùˆ Ø²Ø¨Ø§Ù†ÛŒ Ø§Ø³Øª Ø¢Ø²Ø§Ø¯ Ùˆ Ø¨ÛŒØ´ØªØ± Ø¨Ø±Ø§ÛŒ Ø¨Ø±Ù†Ø§Ù…Ù‡ Ù†ÙˆÛŒØ³ÛŒ Ø³Ù…Øª Ø³Ø±ÙˆØ± Ø¯Ø± ÙˆØ¨ Ú¯Ø§Ù‡Ù‡Ø§ÛŒ Ù¾ÙˆÛŒØ§ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ù…ÛŒ Ø´ÙˆØ¯ .</p><p>Ù…Ù†Ø¨Ø¹ : Ø¨ÛŒÚ©Ø±Ø§Ù†</p>', '2022-12-12 09:43:58', '1');

-- --------------------------------------------------------

--
-- Table structure for table `contactus`
--

DROP TABLE IF EXISTS `contactus`;
CREATE TABLE IF NOT EXISTS `contactus` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `fullname` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `phone` varchar(15) COLLATE utf8_persian_ci NOT NULL,
  `email` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `description` text COLLATE utf8_persian_ci NOT NULL,
  `status` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=63 DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `contactus`
--

INSERT INTO `contactus` (`id`, `fullname`, `phone`, `email`, `description`, `status`) VALUES
(61, 'Ø­Ø³ÛŒÙ† Ø±Ø¶Ø§ÛŒÛŒ', '09139913419', 'hossien@yahoo.com', 'Ø¹Ø±Ø¶ Ø³Ù„Ø§Ù… Ùˆ Ø®ØªØ³Ù‡ Ù†Ø¨Ø§Ø´ÛŒØ¯ Ø®Ø¯Ù…Øª Ø´Ù…Ø§ \r\n\r\nÙ„Ø·ÙØ§ Ù„ÛŒÙ†Ú© Ø¯Ø§Ù†Ù„ÙˆØ¯ Ù¾Ú©ÛŒØ¬ Ù‡Ø§Ø±Ùˆ Ø¨Ø±Ø§Ù… Ø§Ø±Ø³Ø§Ù„ Ú©Ù†ÛŒØ¯\r\n\r\nÙ…Ø±Ø³ÛŒ :)', 1),
(62, 'Ø§Ø­Ù…Ø¯ ØµÙØ§ÛŒÛŒ', '09912345432', 'ahmad@gmail.com', 'Ø§ÛŒÙ† ØªÙˆØ¶ÛŒØ­Ø§Øª Ø¨Ø±Ø§ÛŒ ØªØ³Øª Ø§Ø³Øª .', 1);

-- --------------------------------------------------------

--
-- Table structure for table `messages`
--

DROP TABLE IF EXISTS `messages`;
CREATE TABLE IF NOT EXISTS `messages` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `pid` int(11) NOT NULL,
  `fullname` varchar(60) COLLATE utf8_persian_ci NOT NULL,
  `message` text COLLATE utf8_persian_ci NOT NULL,
  `ctime` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `count_like` int(255) NOT NULL,
  `count_dislike` int(255) NOT NULL,
  `status` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=47 DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `messages`
--

INSERT INTO `messages` (`id`, `pid`, `fullname`, `message`, `ctime`, `count_like`, `count_dislike`, `status`) VALUES
(44, 44, 'Ù…Ø­Ù…Ø¯ Ø­Ø³ÛŒÙ† Ø§Ú©Ø¨Ø±ÛŒØ§Ù†', 'Ù…Ø­ØµÙˆÙ„ Ø®ÙˆØ¨ÛŒ Ù†ÛŒØ³Øª Ùˆ ÙÛŒÚ©Ù‡ Ù„Ø·ÙØ§ Ø±Ø³ÛŒØ¯Ú¯ÛŒ Ú©Ù†ÛŒØ¯', 'Û±Ûµ:ÛµÛ´:Û±Ûµ', 2, 0, 1),
(43, 40, 'Ù…Ø­Ù…Ø¯ Ø­Ø³ÛŒÙ† Ø§Ú©Ø¨Ø±ÛŒØ§Ù†', 'Ù…Ø­ØµÙˆÙ„ Ø¨Ø³ÛŒØ§Ø± Ø®ÙˆØ¨ÛŒÙ‡ Ù…Ù† Ø®Ø±ÛŒØ¯Ù… Ù…Ù…Ù†ÙˆÙ† Ø§Ø² Ø³Ø§ÛŒØª Ø®ÙˆØ¨ØªÙˆÙ†.\r\n', 'Û±Ûµ:Û³Û´:Û³Û²', 5, 9, 1),
(42, 40, 'Ø­Ø³ÛŒÙ† Ù…Ø¯Ø±Ø³', 'Ø¹Ø§Ù„ÛŒØ¹', 'Û±Û´:Û±Û´:Û´Û¸', 1, 2, 1),
(45, 46, 'hamid', 'hnwyhwrhwhbw', 'Û°Û°:Û±Ûµ:ÛµÛ²', 1, 1, 1),
(46, 46, 'Ù…Ø­Ù…Ø¯ Ø­Ø³ÛŒÙ† Ø§Ú©Ø¨Ø±ÛŒØ§Ù†', 'is the bitch', 'Û°Û°:Û±Û·:Û²Û³', 0, 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `product`
--

DROP TABLE IF EXISTS `product`;
CREATE TABLE IF NOT EXISTS `product` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `image` text COLLATE utf8_persian_ci NOT NULL,
  `description` text COLLATE utf8_persian_ci NOT NULL,
  `price` int(255) NOT NULL,
  `status` int(11) NOT NULL DEFAULT '1',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=47 DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `product`
--

INSERT INTO `product` (`id`, `title`, `image`, `description`, `price`, `status`) VALUES
(40, 'Ù„Ù¾ ØªØ§Ù¾ Ù„Ù†ÙˆÙˆ ', '61Dw5Z8LzJL._SL1000_.jpg', 'Ù„ÙˆØ±Ù… Ø§ÛŒÙ¾Ø³ÙˆÙ… Ù…ØªÙ† Ø³Ø§Ø®ØªÚ¯ÛŒ Ø¨Ø§ ØªÙˆÙ„ÛŒØ¯ Ø³Ø§Ø¯Ú¯ÛŒ Ù†Ø§Ù…ÙÙ‡ÙˆÙ… Ø§Ø² ØµÙ†Ø¹Øª Ú†Ø§Ù¾ØŒ Ùˆ Ø¨Ø§ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ø§Ø² Ø·Ø±Ø§Ø­Ø§Ù† Ú¯Ø±Ø§ÙÛŒÚ© Ø§Ø³ØªØŒ Ú†Ø§Ù¾Ú¯Ø±Ù‡Ø§ Ùˆ Ù…ØªÙˆÙ† Ø¨Ù„Ú©Ù‡ Ø±ÙˆØ²Ù†Ø§Ù…Ù‡ Ùˆ Ù…Ø¬Ù„Ù‡ Ø¯Ø± Ø³ØªÙˆÙ† Ùˆ Ø³Ø·Ø±Ø¢Ù†Ú†Ù†Ø§Ù† Ú©Ù‡ Ù„Ø§Ø²Ù… Ø§Ø³ØªØŒ Ùˆ Ø¨Ø±Ø§ÛŒ Ø´Ø±Ø§ÛŒØ· ÙØ¹Ù„ÛŒ ØªÚ©Ù†ÙˆÙ„ÙˆÚ˜ÛŒ Ù…ÙˆØ±Ø¯ Ù†ÛŒØ§Ø²ØŒ Ùˆ Ú©Ø§Ø±Ø¨Ø±Ø¯Ù‡Ø§ÛŒ Ù…ØªÙ†ÙˆØ¹ Ø¨Ø§ Ù‡Ø¯Ù Ø¨Ù‡Ø¨ÙˆØ¯ Ø§Ø¨Ø²Ø§Ø±Ù‡Ø§ÛŒ Ú©Ø§Ø±Ø¨Ø±Ø¯ÛŒ Ù…ÛŒ Ø¨Ø§Ø´Ø¯ØŒ Ú©ØªØ§Ø¨Ù‡Ø§ÛŒ Ø²ÛŒØ§Ø¯ÛŒ Ø¯Ø± Ø´ØµØª Ùˆ Ø³Ù‡ Ø¯Ø±ØµØ¯ Ú¯Ø°Ø´ØªÙ‡ Ø­Ø§Ù„ Ùˆ Ø¢ÛŒÙ†Ø¯Ù‡ØŒ Ø´Ù†Ø§Ø®Øª ÙØ±Ø§ÙˆØ§Ù† Ø¬Ø§Ù…Ø¹Ù‡ Ùˆ Ù…ØªØ®ØµØµØ§Ù† Ø±Ø§ Ù…ÛŒ Ø·Ù„Ø¨Ø¯ØŒ ØªØ§ Ø¨Ø§ Ù†Ø±Ù… Ø§ÙØ²Ø§Ø±Ù‡Ø§ Ø´Ù†Ø§Ø®Øª Ø¨ÛŒØ´ØªØ±ÛŒ Ø±Ø§ Ø¨Ø±Ø§ÛŒ Ø·Ø±Ø§Ø­Ø§Ù† Ø±Ø§ÛŒØ§Ù†Ù‡ Ø§ÛŒ Ø¹Ù„ÛŒ Ø§Ù„Ø®ØµÙˆØµ Ø·Ø±Ø§Ø­Ø§Ù† Ø®Ù„Ø§Ù‚ÛŒØŒ Ùˆ ÙØ±Ù‡Ù†Ú¯ Ù¾ÛŒØ´Ø±Ùˆ Ø¯Ø± Ø²Ø¨Ø§Ù† ÙØ§Ø±Ø³ÛŒ Ø§ÛŒØ¬Ø§Ø¯ Ú©Ø±Ø¯ØŒ Ø¯Ø± Ø§ÛŒÙ† ØµÙˆØ±Øª Ù…ÛŒ ØªÙˆØ§Ù† Ø§Ù…ÛŒØ¯ Ø¯Ø§Ø´Øª Ú©Ù‡ ØªÙ…Ø§Ù… Ùˆ Ø¯Ø´ÙˆØ§Ø±ÛŒ Ù…ÙˆØ¬ÙˆØ¯ Ø¯Ø± Ø§Ø±Ø§Ø¦Ù‡ Ø±Ø§Ù‡Ú©Ø§Ø±Ù‡Ø§ØŒ Ùˆ Ø´Ø±Ø§ÛŒØ· Ø³Ø®Øª ØªØ§ÛŒÙ¾ Ø¨Ù‡ Ù¾Ø§ÛŒØ§Ù† Ø±Ø³Ø¯ Ùˆ Ø²Ù…Ø§Ù† Ù…ÙˆØ±Ø¯ Ù†ÛŒØ§Ø² Ø´Ø§Ù…Ù„ Ø­Ø±ÙˆÙÚ†ÛŒÙ†ÛŒ Ø¯Ø³ØªØ§ÙˆØ±Ø¯Ù‡Ø§ÛŒ Ø§ØµÙ„ÛŒØŒ Ùˆ Ø¬ÙˆØ§Ø¨Ú¯ÙˆÛŒ Ø³ÙˆØ§Ù„Ø§Øª Ù¾ÛŒÙˆØ³ØªÙ‡ Ø§Ù‡Ù„ Ø¯Ù†ÛŒØ§ÛŒ Ù…ÙˆØ¬ÙˆØ¯ Ø·Ø±Ø§Ø­ÛŒ Ø§Ø³Ø§Ø³Ø§ Ù…ÙˆØ±Ø¯ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ù‚Ø±Ø§Ø± Ú¯ÛŒØ±Ø¯.', 6500000, 1),
(41, 'Ù„Ù¾ ØªØ§Ù¾ Ù…Ú©', 'index.jpg', 'Ù„ÙˆØ±Ù… Ø§ÛŒÙ¾Ø³ÙˆÙ… Ù…ØªÙ† Ø³Ø§Ø®ØªÚ¯ÛŒ Ø¨Ø§ ØªÙˆÙ„ÛŒØ¯ Ø³Ø§Ø¯Ú¯ÛŒ Ù†Ø§Ù…ÙÙ‡ÙˆÙ… Ø§Ø² ØµÙ†Ø¹Øª Ú†Ø§Ù¾ØŒ Ùˆ Ø¨Ø§ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ø§Ø² Ø·Ø±Ø§Ø­Ø§Ù† Ú¯Ø±Ø§ÙÛŒÚ© Ø§Ø³ØªØŒ Ú†Ø§Ù¾Ú¯Ø±Ù‡Ø§ Ùˆ Ù…ØªÙˆÙ† Ø¨Ù„Ú©Ù‡ Ø±ÙˆØ²Ù†Ø§Ù…Ù‡ Ùˆ Ù…Ø¬Ù„Ù‡ Ø¯Ø± Ø³ØªÙˆÙ† Ùˆ Ø³Ø·Ø±Ø¢Ù†Ú†Ù†Ø§Ù† Ú©Ù‡ Ù„Ø§Ø²Ù… Ø§Ø³ØªØŒ Ùˆ Ø¨Ø±Ø§ÛŒ Ø´Ø±Ø§ÛŒØ· ÙØ¹Ù„ÛŒ ØªÚ©Ù†ÙˆÙ„ÙˆÚ˜ÛŒ Ù…ÙˆØ±Ø¯ Ù†ÛŒØ§Ø²ØŒ Ùˆ Ú©Ø§Ø±Ø¨Ø±Ø¯Ù‡Ø§ÛŒ Ù…ØªÙ†ÙˆØ¹ Ø¨Ø§ Ù‡Ø¯Ù Ø¨Ù‡Ø¨ÙˆØ¯ Ø§Ø¨Ø²Ø§Ø±Ù‡Ø§ÛŒ Ú©Ø§Ø±Ø¨Ø±Ø¯ÛŒ Ù…ÛŒ Ø¨Ø§Ø´Ø¯ØŒ Ú©ØªØ§Ø¨Ù‡Ø§ÛŒ Ø²ÛŒØ§Ø¯ÛŒ Ø¯Ø± Ø´ØµØª Ùˆ Ø³Ù‡ Ø¯Ø±ØµØ¯ Ú¯Ø°Ø´ØªÙ‡ Ø­Ø§Ù„ Ùˆ Ø¢ÛŒÙ†Ø¯Ù‡ØŒ Ø´Ù†Ø§Ø®Øª ÙØ±Ø§ÙˆØ§Ù† Ø¬Ø§Ù…Ø¹Ù‡ Ùˆ Ù…ØªØ®ØµØµØ§Ù† Ø±Ø§ Ù…ÛŒ Ø·Ù„Ø¨Ø¯ØŒ ØªØ§ Ø¨Ø§ Ù†Ø±Ù… Ø§ÙØ²Ø§Ø±Ù‡Ø§ Ø´Ù†Ø§Ø®Øª Ø¨ÛŒØ´ØªØ±ÛŒ Ø±Ø§ Ø¨Ø±Ø§ÛŒ Ø·Ø±Ø§Ø­Ø§Ù† Ø±Ø§ÛŒØ§Ù†Ù‡ Ø§ÛŒ Ø¹Ù„ÛŒ Ø§Ù„Ø®ØµÙˆØµ Ø·Ø±Ø§Ø­Ø§Ù† Ø®Ù„Ø§Ù‚ÛŒØŒ Ùˆ ÙØ±Ù‡Ù†Ú¯ Ù¾ÛŒØ´Ø±Ùˆ Ø¯Ø± Ø²Ø¨Ø§Ù† ÙØ§Ø±Ø³ÛŒ Ø§ÛŒØ¬Ø§Ø¯ Ú©Ø±Ø¯ØŒ Ø¯Ø± Ø§ÛŒÙ† ØµÙˆØ±Øª Ù…ÛŒ ØªÙˆØ§Ù† Ø§Ù…ÛŒØ¯ Ø¯Ø§Ø´Øª Ú©Ù‡ ØªÙ…Ø§Ù… Ùˆ Ø¯Ø´ÙˆØ§Ø±ÛŒ Ù…ÙˆØ¬ÙˆØ¯ Ø¯Ø± Ø§Ø±Ø§Ø¦Ù‡ Ø±Ø§Ù‡Ú©Ø§Ø±Ù‡Ø§ØŒ Ùˆ Ø´Ø±Ø§ÛŒØ· Ø³Ø®Øª ØªØ§ÛŒÙ¾ Ø¨Ù‡ Ù¾Ø§ÛŒØ§Ù† Ø±Ø³Ø¯ Ùˆ Ø²Ù…Ø§Ù† Ù…ÙˆØ±Ø¯ Ù†ÛŒØ§Ø² Ø´Ø§Ù…Ù„ Ø­Ø±ÙˆÙÚ†ÛŒÙ†ÛŒ Ø¯Ø³ØªØ§ÙˆØ±Ø¯Ù‡Ø§ÛŒ Ø§ØµÙ„ÛŒØŒ Ùˆ Ø¬ÙˆØ§Ø¨Ú¯ÙˆÛŒ Ø³ÙˆØ§Ù„Ø§Øª Ù¾ÛŒÙˆØ³ØªÙ‡ Ø§Ù‡Ù„ Ø¯Ù†ÛŒØ§ÛŒ Ù…ÙˆØ¬ÙˆØ¯ Ø·Ø±Ø§Ø­ÛŒ Ø§Ø³Ø§Ø³Ø§ Ù…ÙˆØ±Ø¯ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ù‚Ø±Ø§Ø± Ú¯ÛŒØ±Ø¯.', 3900000, 1),
(45, 'Ù…Ø§Ø´ÛŒÙ† Ù„Ø¨Ø§Ø³Ø´ÙˆÛŒÛŒ', 'b27658b4c1f1bd2d9d98f845cab3d3b6006a9f1a_1625130852.jpg', 'Ù…Ø§Ø´ÛŒÙ† Ù„Ø¨Ø§Ø³Ø´ÙˆÛŒÛŒ\r\n Ù…Ø§Ø´ÛŒÙ† Ù„Ø¨Ø§Ø³Ø´ÙˆÛŒÛŒYU', 5700000, 1),
(46, 'ÛŒØ®Ú†Ø§Ù„', '8141e72f2fd484c8dce99cdacd5318972c887e2b_1601892401.jpg', 'ÛŒØ®Ú†Ø§Ù„\r\nÛŒØ®Ú†Ø§Ù„\r\nÛŒØ®Ú†Ø§Ù„', 2000000, 1),
(43, 'Ø§ÛŒØ³ÙˆØ³ ØªØ§Ù ', 'images.jpg', 'Ù„ÙˆØ±Ù… Ø§ÛŒÙ¾Ø³ÙˆÙ… Ù…ØªÙ† Ø³Ø§Ø®ØªÚ¯ÛŒ Ø¨Ø§ ØªÙˆÙ„ÛŒØ¯ Ø³Ø§Ø¯Ú¯ÛŒ Ù†Ø§Ù…ÙÙ‡ÙˆÙ… Ø§Ø² ØµÙ†Ø¹Øª Ú†Ø§Ù¾ØŒ Ùˆ Ø¨Ø§ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ø§Ø² Ø·Ø±Ø§Ø­Ø§Ù† Ú¯Ø±Ø§ÙÛŒÚ© Ø§Ø³ØªØŒ Ú†Ø§Ù¾Ú¯Ø±Ù‡Ø§ Ùˆ Ù…ØªÙˆÙ† Ø¨Ù„Ú©Ù‡ Ø±ÙˆØ²Ù†Ø§Ù…Ù‡ Ùˆ Ù…Ø¬Ù„Ù‡ Ø¯Ø± Ø³ØªÙˆÙ† Ùˆ Ø³Ø·Ø±Ø¢Ù†Ú†Ù†Ø§Ù† Ú©Ù‡ Ù„Ø§Ø²Ù… Ø§Ø³ØªØŒ Ùˆ Ø¨Ø±Ø§ÛŒ Ø´Ø±Ø§ÛŒØ· ÙØ¹Ù„ÛŒ ØªÚ©Ù†ÙˆÙ„ÙˆÚ˜ÛŒ Ù…ÙˆØ±Ø¯ Ù†ÛŒØ§Ø²ØŒ Ùˆ Ú©Ø§Ø±Ø¨Ø±Ø¯Ù‡Ø§ÛŒ Ù…ØªÙ†ÙˆØ¹ Ø¨Ø§ Ù‡Ø¯Ù Ø¨Ù‡Ø¨ÙˆØ¯ Ø§Ø¨Ø²Ø§Ø±Ù‡Ø§ÛŒ Ú©Ø§Ø±Ø¨Ø±Ø¯ÛŒ Ù…ÛŒ Ø¨Ø§Ø´Ø¯ØŒ Ú©ØªØ§Ø¨Ù‡Ø§ÛŒ Ø²ÛŒØ§Ø¯ÛŒ Ø¯Ø± Ø´ØµØª Ùˆ Ø³Ù‡ Ø¯Ø±ØµØ¯ Ú¯Ø°Ø´ØªÙ‡ Ø­Ø§Ù„ Ùˆ Ø¢ÛŒÙ†Ø¯Ù‡ØŒ Ø´Ù†Ø§Ø®Øª ÙØ±Ø§ÙˆØ§Ù† Ø¬Ø§Ù…Ø¹Ù‡ Ùˆ Ù…ØªØ®ØµØµØ§Ù† Ø±Ø§ Ù…ÛŒ Ø·Ù„Ø¨Ø¯ØŒ ØªØ§ Ø¨Ø§ Ù†Ø±Ù… Ø§ÙØ²Ø§Ø±Ù‡Ø§ Ø´Ù†Ø§Ø®Øª Ø¨ÛŒØ´ØªØ±ÛŒ Ø±Ø§ Ø¨Ø±Ø§ÛŒ Ø·Ø±Ø§Ø­Ø§Ù† Ø±Ø§ÛŒØ§Ù†Ù‡ Ø§ÛŒ Ø¹Ù„ÛŒ Ø§Ù„Ø®ØµÙˆØµ Ø·Ø±Ø§Ø­Ø§Ù† Ø®Ù„Ø§Ù‚ÛŒØŒ Ùˆ ÙØ±Ù‡Ù†Ú¯ Ù¾ÛŒØ´Ø±Ùˆ Ø¯Ø± Ø²Ø¨Ø§Ù† ÙØ§Ø±Ø³ÛŒ Ø§ÛŒØ¬Ø§Ø¯ Ú©Ø±Ø¯ØŒ Ø¯Ø± Ø§ÛŒÙ† ØµÙˆØ±Øª Ù…ÛŒ ØªÙˆØ§Ù† Ø§Ù…ÛŒØ¯ Ø¯Ø§Ø´Øª Ú©Ù‡ ØªÙ…Ø§Ù… Ùˆ Ø¯Ø´ÙˆØ§Ø±ÛŒ Ù…ÙˆØ¬ÙˆØ¯ Ø¯Ø± Ø§Ø±Ø§Ø¦Ù‡ Ø±Ø§Ù‡Ú©Ø§Ø±Ù‡Ø§ØŒ Ùˆ Ø´Ø±Ø§ÛŒØ· Ø³Ø®Øª ØªØ§ÛŒÙ¾ Ø¨Ù‡ Ù¾Ø§ÛŒØ§Ù† Ø±Ø³Ø¯ Ùˆ Ø²Ù…Ø§Ù† Ù…ÙˆØ±Ø¯ Ù†ÛŒØ§Ø² Ø´Ø§Ù…Ù„ Ø­Ø±ÙˆÙÚ†ÛŒÙ†ÛŒ Ø¯Ø³ØªØ§ÙˆØ±Ø¯Ù‡Ø§ÛŒ Ø§ØµÙ„ÛŒØŒ Ùˆ Ø¬ÙˆØ§Ø¨Ú¯ÙˆÛŒ Ø³ÙˆØ§Ù„Ø§Øª Ù¾ÛŒÙˆØ³ØªÙ‡ Ø§Ù‡Ù„ Ø¯Ù†ÛŒØ§ÛŒ Ù…ÙˆØ¬ÙˆØ¯ Ø·Ø±Ø§Ø­ÛŒ Ø§Ø³Ø§Ø³Ø§ Ù…ÙˆØ±Ø¯ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ù‚Ø±Ø§Ø± Ú¯ÛŒØ±Ø¯.', 30000000, 1),
(44, 'Ù„Ú† ØªØ§Ú† Ø¯Ù„', 's.jpg', 'Ù„ÙˆØ±Ù… Ø§ÛŒÙ¾Ø³ÙˆÙ… Ù…ØªÙ† Ø³Ø§Ø®ØªÚ¯ÛŒ Ø¨Ø§ ØªÙˆÙ„ÛŒØ¯ Ø³Ø§Ø¯Ú¯ÛŒ Ù†Ø§Ù…ÙÙ‡ÙˆÙ… Ø§Ø² ØµÙ†Ø¹Øª Ú†Ø§Ù¾ØŒ Ùˆ Ø¨Ø§ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ø§Ø² Ø·Ø±Ø§Ø­Ø§Ù† Ú¯Ø±Ø§ÙÛŒÚ© Ø§Ø³ØªØŒ Ú†Ø§Ù¾Ú¯Ø±Ù‡Ø§ Ùˆ Ù…ØªÙˆÙ† Ø¨Ù„Ú©Ù‡ Ø±ÙˆØ²Ù†Ø§Ù…Ù‡ Ùˆ Ù…Ø¬Ù„Ù‡ Ø¯Ø± Ø³ØªÙˆÙ† Ùˆ Ø³Ø·Ø±Ø¢Ù†Ú†Ù†Ø§Ù† Ú©Ù‡ Ù„Ø§Ø²Ù… Ø§Ø³ØªØŒ Ùˆ Ø¨Ø±Ø§ÛŒ Ø´Ø±Ø§ÛŒØ· ÙØ¹Ù„ÛŒ ØªÚ©Ù†ÙˆÙ„ÙˆÚ˜ÛŒ Ù…ÙˆØ±Ø¯ Ù†ÛŒØ§Ø²ØŒ Ùˆ Ú©Ø§Ø±Ø¨Ø±Ø¯Ù‡Ø§ÛŒ Ù…ØªÙ†ÙˆØ¹ Ø¨Ø§ Ù‡Ø¯Ù Ø¨Ù‡Ø¨ÙˆØ¯ Ø§Ø¨Ø²Ø§Ø±Ù‡Ø§ÛŒ Ú©Ø§Ø±Ø¨Ø±Ø¯ÛŒ Ù…ÛŒ Ø¨Ø§Ø´Ø¯ØŒ Ú©ØªØ§Ø¨Ù‡Ø§ÛŒ Ø²ÛŒØ§Ø¯ÛŒ Ø¯Ø± Ø´ØµØª Ùˆ Ø³Ù‡ Ø¯Ø±ØµØ¯ Ú¯Ø°Ø´ØªÙ‡ Ø­Ø§Ù„ Ùˆ Ø¢ÛŒÙ†Ø¯Ù‡ØŒ Ø´Ù†Ø§Ø®Øª ÙØ±Ø§ÙˆØ§Ù† Ø¬Ø§Ù…Ø¹Ù‡ Ùˆ Ù…ØªØ®ØµØµØ§Ù† Ø±Ø§ Ù…ÛŒ Ø·Ù„Ø¨Ø¯ØŒ ØªØ§ Ø¨Ø§ Ù†Ø±Ù… Ø§ÙØ²Ø§Ø±Ù‡Ø§ Ø´Ù†Ø§Ø®Øª Ø¨ÛŒØ´ØªØ±ÛŒ Ø±Ø§ Ø¨Ø±Ø§ÛŒ Ø·Ø±Ø§Ø­Ø§Ù† Ø±Ø§ÛŒØ§Ù†Ù‡ Ø§ÛŒ Ø¹Ù„ÛŒ Ø§Ù„Ø®ØµÙˆØµ Ø·Ø±Ø§Ø­Ø§Ù† Ø®Ù„Ø§Ù‚ÛŒØŒ Ùˆ ÙØ±Ù‡Ù†Ú¯ Ù¾ÛŒØ´Ø±Ùˆ Ø¯Ø± Ø²Ø¨Ø§Ù† ÙØ§Ø±Ø³ÛŒ Ø§ÛŒØ¬Ø§Ø¯ Ú©Ø±Ø¯ØŒ Ø¯Ø± Ø§ÛŒÙ† ØµÙˆØ±Øª Ù…ÛŒ ØªÙˆØ§Ù† Ø§Ù…ÛŒØ¯ Ø¯Ø§Ø´Øª Ú©Ù‡ ØªÙ…Ø§Ù… Ùˆ Ø¯Ø´ÙˆØ§Ø±ÛŒ Ù…ÙˆØ¬ÙˆØ¯ Ø¯Ø± Ø§Ø±Ø§Ø¦Ù‡ Ø±Ø§Ù‡Ú©Ø§Ø±Ù‡Ø§ØŒ Ùˆ Ø´Ø±Ø§ÛŒØ· Ø³Ø®Øª ØªØ§ÛŒÙ¾ Ø¨Ù‡ Ù¾Ø§ÛŒØ§Ù† Ø±Ø³Ø¯ Ùˆ Ø²Ù…Ø§Ù† Ù…ÙˆØ±Ø¯ Ù†ÛŒØ§Ø² Ø´Ø§Ù…Ù„ Ø­Ø±ÙˆÙÚ†ÛŒÙ†ÛŒ Ø¯Ø³ØªØ§ÙˆØ±Ø¯Ù‡Ø§ÛŒ Ø§ØµÙ„ÛŒØŒ Ùˆ Ø¬ÙˆØ§Ø¨Ú¯ÙˆÛŒ Ø³ÙˆØ§Ù„Ø§Øª Ù¾ÛŒÙˆØ³ØªÙ‡ Ø§Ù‡Ù„ Ø¯Ù†ÛŒØ§ÛŒ Ù…ÙˆØ¬ÙˆØ¯ Ø·Ø±Ø§Ø­ÛŒ Ø§Ø³Ø§Ø³Ø§ Ù…ÙˆØ±Ø¯ Ø§Ø³ØªÙØ§Ø¯Ù‡ Ù‚Ø±Ø§Ø± Ú¯ÛŒØ±Ø¯.', 21500000, 1);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
CREATE TABLE IF NOT EXISTS `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `fullname` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `phone` varchar(11) COLLATE utf8_persian_ci NOT NULL,
  `email` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `password` varchar(100) COLLATE utf8_persian_ci NOT NULL,
  `status` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=81 DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `fullname`, `phone`, `email`, `password`, `status`) VALUES
(77, 'amirali', '09913508394', 'amirhossien.zeyn1391@gmail.com', '8509121', 0),
(19, 'ali kazemi', '09138545609', 'mohsenkamali@yahoo.com', 'mohsen123', 0),
(16, 'amir ghasemi', '09123451789', 'amirhossien.zeyn1391@gmail.com', '123456', 0),
(15, 'Ù…Ø­Ù…Ø¯ Ø­Ø³ÛŒÙ† Ø§Ú©Ø¨Ø±ÛŒØ§Ù†', '09121781624', 'm.h.a1378@gmail.com', 'm123', 1),
(14, 'ali ghasemi', '09134678129', 'alighasemi@gmail.com', 'ali12345', 1),
(18, 'amir hasani', '09123451789', 'amir@gmail.com', 'amir123', 1),
(78, 'Ø­Ø³Ù† Ù‚Ø§Ø³Ù…ÛŒ', '09123456789', 'hasan@gmail.com', 'hasan123', 0),
(79, 'Ø­Ø³ÛŒÙ† Ù…Ø¯Ø±Ø³', '09216052133', 'hosseinmodarres2014@gmail.com', 'h123', 1),
(80, 'hamid', '09915469677', 'hamidgpg@gmail.com', '1234', 1);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
